/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage, Align> {
    storage: Storage,
    align: [Align; 0],
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage, align: [] }
    }
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]

pub const MC_CAPS_TM: u32 = 2;
pub const MC_CAPS_LINUX: u32 = 3;
pub const MC_CAPS_STD_ECX: u32 = 4;
pub const MC_CAPS_VIA: u32 = 5;
pub const MC_CAPS_AMD_ECX: u32 = 6;
pub const XEN_MC_fetch: u32 = 1;
pub const XEN_MC_notifydomain: u32 = 2;
pub const XEN_MC_physcpuinfo: u32 = 3;
pub const XEN_MC_msrinject: u32 = 4;
pub const MC_MSRINJ_MAXMSRS: u32 = 8;
pub const MC_MSRINJ_F_INTERPOSE: u32 = 1;
pub const MC_MSRINJ_F_GPADDR: u32 = 2;
pub const XEN_MC_mceinject: u32 = 5;
pub const XEN_MC_inject_v2: u32 = 6;
pub const XEN_MC_INJECT_TYPE_MASK: u32 = 7;
pub const XEN_MC_INJECT_TYPE_MCE: u32 = 0;
pub const XEN_MC_INJECT_TYPE_CMCI: u32 = 1;
pub const XEN_MC_INJECT_TYPE_LMCE: u32 = 2;
pub const XEN_MC_INJECT_CPU_BROADCAST: u32 = 8;
pub const XC_PAGE_SHIFT: u32 = 12;
pub const XC_PAGE_SIZE: u32 = 4096;
pub const XC_PAGE_MASK: i32 = -4096;
pub const INVALID_MFN: i32 = -1;
pub const XENCTRL_HAS_XC_INTERFACE: u32 = 1;
pub const XC_CORE_MAGIC: u32 = 4027575277;
pub const XC_CORE_MAGIC_HVM: u32 = 4027575278;
pub const XC_CPUPOOL_POOLID_ANY: u32 = 4294967295;
pub const E820_RAM: u32 = 1;
pub const E820_RESERVED: u32 = 2;
pub const E820_ACPI: u32 = 3;
pub const E820_NVS: u32 = 4;
pub const E820_UNUSABLE: u32 = 5;
pub const E820MAX: u32 = 128;
pub const XC_MAX_ERROR_MSG_LEN: u32 = 1024;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type gid_t = __gid_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type useconds_t = __useconds_t;
pub type pid_t = __pid_t;
pub type socklen_t = __socklen_t;
extern "C" {
    pub fn access(
        __name: *const ::std::os::raw::c_char,
        __type: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn faccessat(
        __fd: ::std::os::raw::c_int,
        __file: *const ::std::os::raw::c_char,
        __type: ::std::os::raw::c_int,
        __flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lseek(
        __fd: ::std::os::raw::c_int,
        __offset: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> __off_t;
}
extern "C" {
    pub fn close(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn read(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __nbytes: usize,
    ) -> isize;
}
extern "C" {
    pub fn write(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> isize;
}
extern "C" {
    pub fn pread(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __nbytes: usize,
        __offset: __off_t,
    ) -> isize;
}
extern "C" {
    pub fn pwrite(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: usize,
        __offset: __off_t,
    ) -> isize;
}
extern "C" {
    pub fn pipe(__pipedes: *mut ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn alarm(__seconds: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn sleep(__seconds: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn ualarm(__value: __useconds_t, __interval: __useconds_t) -> __useconds_t;
}
extern "C" {
    pub fn usleep(__useconds: __useconds_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pause() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn chown(
        __file: *const ::std::os::raw::c_char,
        __owner: __uid_t,
        __group: __gid_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fchown(
        __fd: ::std::os::raw::c_int,
        __owner: __uid_t,
        __group: __gid_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lchown(
        __file: *const ::std::os::raw::c_char,
        __owner: __uid_t,
        __group: __gid_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fchownat(
        __fd: ::std::os::raw::c_int,
        __file: *const ::std::os::raw::c_char,
        __owner: __uid_t,
        __group: __gid_t,
        __flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn chdir(__path: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fchdir(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getcwd(__buf: *mut ::std::os::raw::c_char, __size: usize)
        -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn getwd(__buf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn dup(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dup2(__fd: ::std::os::raw::c_int, __fd2: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub static mut __environ: *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn execve(
        __path: *const ::std::os::raw::c_char,
        __argv: *const *mut ::std::os::raw::c_char,
        __envp: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fexecve(
        __fd: ::std::os::raw::c_int,
        __argv: *const *mut ::std::os::raw::c_char,
        __envp: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execv(
        __path: *const ::std::os::raw::c_char,
        __argv: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execle(
        __path: *const ::std::os::raw::c_char,
        __arg: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execl(
        __path: *const ::std::os::raw::c_char,
        __arg: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execvp(
        __file: *const ::std::os::raw::c_char,
        __argv: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execlp(
        __file: *const ::std::os::raw::c_char,
        __arg: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nice(__inc: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _exit(__status: ::std::os::raw::c_int);
}
pub const _PC_LINK_MAX: _bindgen_ty_1 = 0;
pub const _PC_MAX_CANON: _bindgen_ty_1 = 1;
pub const _PC_MAX_INPUT: _bindgen_ty_1 = 2;
pub const _PC_NAME_MAX: _bindgen_ty_1 = 3;
pub const _PC_PATH_MAX: _bindgen_ty_1 = 4;
pub const _PC_PIPE_BUF: _bindgen_ty_1 = 5;
pub const _PC_CHOWN_RESTRICTED: _bindgen_ty_1 = 6;
pub const _PC_NO_TRUNC: _bindgen_ty_1 = 7;
pub const _PC_VDISABLE: _bindgen_ty_1 = 8;
pub const _PC_SYNC_IO: _bindgen_ty_1 = 9;
pub const _PC_ASYNC_IO: _bindgen_ty_1 = 10;
pub const _PC_PRIO_IO: _bindgen_ty_1 = 11;
pub const _PC_SOCK_MAXBUF: _bindgen_ty_1 = 12;
pub const _PC_FILESIZEBITS: _bindgen_ty_1 = 13;
pub const _PC_REC_INCR_XFER_SIZE: _bindgen_ty_1 = 14;
pub const _PC_REC_MAX_XFER_SIZE: _bindgen_ty_1 = 15;
pub const _PC_REC_MIN_XFER_SIZE: _bindgen_ty_1 = 16;
pub const _PC_REC_XFER_ALIGN: _bindgen_ty_1 = 17;
pub const _PC_ALLOC_SIZE_MIN: _bindgen_ty_1 = 18;
pub const _PC_SYMLINK_MAX: _bindgen_ty_1 = 19;
pub const _PC_2_SYMLINKS: _bindgen_ty_1 = 20;
pub type _bindgen_ty_1 = u32;
pub const _SC_ARG_MAX: _bindgen_ty_2 = 0;
pub const _SC_CHILD_MAX: _bindgen_ty_2 = 1;
pub const _SC_CLK_TCK: _bindgen_ty_2 = 2;
pub const _SC_NGROUPS_MAX: _bindgen_ty_2 = 3;
pub const _SC_OPEN_MAX: _bindgen_ty_2 = 4;
pub const _SC_STREAM_MAX: _bindgen_ty_2 = 5;
pub const _SC_TZNAME_MAX: _bindgen_ty_2 = 6;
pub const _SC_JOB_CONTROL: _bindgen_ty_2 = 7;
pub const _SC_SAVED_IDS: _bindgen_ty_2 = 8;
pub const _SC_REALTIME_SIGNALS: _bindgen_ty_2 = 9;
pub const _SC_PRIORITY_SCHEDULING: _bindgen_ty_2 = 10;
pub const _SC_TIMERS: _bindgen_ty_2 = 11;
pub const _SC_ASYNCHRONOUS_IO: _bindgen_ty_2 = 12;
pub const _SC_PRIORITIZED_IO: _bindgen_ty_2 = 13;
pub const _SC_SYNCHRONIZED_IO: _bindgen_ty_2 = 14;
pub const _SC_FSYNC: _bindgen_ty_2 = 15;
pub const _SC_MAPPED_FILES: _bindgen_ty_2 = 16;
pub const _SC_MEMLOCK: _bindgen_ty_2 = 17;
pub const _SC_MEMLOCK_RANGE: _bindgen_ty_2 = 18;
pub const _SC_MEMORY_PROTECTION: _bindgen_ty_2 = 19;
pub const _SC_MESSAGE_PASSING: _bindgen_ty_2 = 20;
pub const _SC_SEMAPHORES: _bindgen_ty_2 = 21;
pub const _SC_SHARED_MEMORY_OBJECTS: _bindgen_ty_2 = 22;
pub const _SC_AIO_LISTIO_MAX: _bindgen_ty_2 = 23;
pub const _SC_AIO_MAX: _bindgen_ty_2 = 24;
pub const _SC_AIO_PRIO_DELTA_MAX: _bindgen_ty_2 = 25;
pub const _SC_DELAYTIMER_MAX: _bindgen_ty_2 = 26;
pub const _SC_MQ_OPEN_MAX: _bindgen_ty_2 = 27;
pub const _SC_MQ_PRIO_MAX: _bindgen_ty_2 = 28;
pub const _SC_VERSION: _bindgen_ty_2 = 29;
pub const _SC_PAGESIZE: _bindgen_ty_2 = 30;
pub const _SC_RTSIG_MAX: _bindgen_ty_2 = 31;
pub const _SC_SEM_NSEMS_MAX: _bindgen_ty_2 = 32;
pub const _SC_SEM_VALUE_MAX: _bindgen_ty_2 = 33;
pub const _SC_SIGQUEUE_MAX: _bindgen_ty_2 = 34;
pub const _SC_TIMER_MAX: _bindgen_ty_2 = 35;
pub const _SC_BC_BASE_MAX: _bindgen_ty_2 = 36;
pub const _SC_BC_DIM_MAX: _bindgen_ty_2 = 37;
pub const _SC_BC_SCALE_MAX: _bindgen_ty_2 = 38;
pub const _SC_BC_STRING_MAX: _bindgen_ty_2 = 39;
pub const _SC_COLL_WEIGHTS_MAX: _bindgen_ty_2 = 40;
pub const _SC_EQUIV_CLASS_MAX: _bindgen_ty_2 = 41;
pub const _SC_EXPR_NEST_MAX: _bindgen_ty_2 = 42;
pub const _SC_LINE_MAX: _bindgen_ty_2 = 43;
pub const _SC_RE_DUP_MAX: _bindgen_ty_2 = 44;
pub const _SC_CHARCLASS_NAME_MAX: _bindgen_ty_2 = 45;
pub const _SC_2_VERSION: _bindgen_ty_2 = 46;
pub const _SC_2_C_BIND: _bindgen_ty_2 = 47;
pub const _SC_2_C_DEV: _bindgen_ty_2 = 48;
pub const _SC_2_FORT_DEV: _bindgen_ty_2 = 49;
pub const _SC_2_FORT_RUN: _bindgen_ty_2 = 50;
pub const _SC_2_SW_DEV: _bindgen_ty_2 = 51;
pub const _SC_2_LOCALEDEF: _bindgen_ty_2 = 52;
pub const _SC_PII: _bindgen_ty_2 = 53;
pub const _SC_PII_XTI: _bindgen_ty_2 = 54;
pub const _SC_PII_SOCKET: _bindgen_ty_2 = 55;
pub const _SC_PII_INTERNET: _bindgen_ty_2 = 56;
pub const _SC_PII_OSI: _bindgen_ty_2 = 57;
pub const _SC_POLL: _bindgen_ty_2 = 58;
pub const _SC_SELECT: _bindgen_ty_2 = 59;
pub const _SC_UIO_MAXIOV: _bindgen_ty_2 = 60;
pub const _SC_IOV_MAX: _bindgen_ty_2 = 60;
pub const _SC_PII_INTERNET_STREAM: _bindgen_ty_2 = 61;
pub const _SC_PII_INTERNET_DGRAM: _bindgen_ty_2 = 62;
pub const _SC_PII_OSI_COTS: _bindgen_ty_2 = 63;
pub const _SC_PII_OSI_CLTS: _bindgen_ty_2 = 64;
pub const _SC_PII_OSI_M: _bindgen_ty_2 = 65;
pub const _SC_T_IOV_MAX: _bindgen_ty_2 = 66;
pub const _SC_THREADS: _bindgen_ty_2 = 67;
pub const _SC_THREAD_SAFE_FUNCTIONS: _bindgen_ty_2 = 68;
pub const _SC_GETGR_R_SIZE_MAX: _bindgen_ty_2 = 69;
pub const _SC_GETPW_R_SIZE_MAX: _bindgen_ty_2 = 70;
pub const _SC_LOGIN_NAME_MAX: _bindgen_ty_2 = 71;
pub const _SC_TTY_NAME_MAX: _bindgen_ty_2 = 72;
pub const _SC_THREAD_DESTRUCTOR_ITERATIONS: _bindgen_ty_2 = 73;
pub const _SC_THREAD_KEYS_MAX: _bindgen_ty_2 = 74;
pub const _SC_THREAD_STACK_MIN: _bindgen_ty_2 = 75;
pub const _SC_THREAD_THREADS_MAX: _bindgen_ty_2 = 76;
pub const _SC_THREAD_ATTR_STACKADDR: _bindgen_ty_2 = 77;
pub const _SC_THREAD_ATTR_STACKSIZE: _bindgen_ty_2 = 78;
pub const _SC_THREAD_PRIORITY_SCHEDULING: _bindgen_ty_2 = 79;
pub const _SC_THREAD_PRIO_INHERIT: _bindgen_ty_2 = 80;
pub const _SC_THREAD_PRIO_PROTECT: _bindgen_ty_2 = 81;
pub const _SC_THREAD_PROCESS_SHARED: _bindgen_ty_2 = 82;
pub const _SC_NPROCESSORS_CONF: _bindgen_ty_2 = 83;
pub const _SC_NPROCESSORS_ONLN: _bindgen_ty_2 = 84;
pub const _SC_PHYS_PAGES: _bindgen_ty_2 = 85;
pub const _SC_AVPHYS_PAGES: _bindgen_ty_2 = 86;
pub const _SC_ATEXIT_MAX: _bindgen_ty_2 = 87;
pub const _SC_PASS_MAX: _bindgen_ty_2 = 88;
pub const _SC_XOPEN_VERSION: _bindgen_ty_2 = 89;
pub const _SC_XOPEN_XCU_VERSION: _bindgen_ty_2 = 90;
pub const _SC_XOPEN_UNIX: _bindgen_ty_2 = 91;
pub const _SC_XOPEN_CRYPT: _bindgen_ty_2 = 92;
pub const _SC_XOPEN_ENH_I18N: _bindgen_ty_2 = 93;
pub const _SC_XOPEN_SHM: _bindgen_ty_2 = 94;
pub const _SC_2_CHAR_TERM: _bindgen_ty_2 = 95;
pub const _SC_2_C_VERSION: _bindgen_ty_2 = 96;
pub const _SC_2_UPE: _bindgen_ty_2 = 97;
pub const _SC_XOPEN_XPG2: _bindgen_ty_2 = 98;
pub const _SC_XOPEN_XPG3: _bindgen_ty_2 = 99;
pub const _SC_XOPEN_XPG4: _bindgen_ty_2 = 100;
pub const _SC_CHAR_BIT: _bindgen_ty_2 = 101;
pub const _SC_CHAR_MAX: _bindgen_ty_2 = 102;
pub const _SC_CHAR_MIN: _bindgen_ty_2 = 103;
pub const _SC_INT_MAX: _bindgen_ty_2 = 104;
pub const _SC_INT_MIN: _bindgen_ty_2 = 105;
pub const _SC_LONG_BIT: _bindgen_ty_2 = 106;
pub const _SC_WORD_BIT: _bindgen_ty_2 = 107;
pub const _SC_MB_LEN_MAX: _bindgen_ty_2 = 108;
pub const _SC_NZERO: _bindgen_ty_2 = 109;
pub const _SC_SSIZE_MAX: _bindgen_ty_2 = 110;
pub const _SC_SCHAR_MAX: _bindgen_ty_2 = 111;
pub const _SC_SCHAR_MIN: _bindgen_ty_2 = 112;
pub const _SC_SHRT_MAX: _bindgen_ty_2 = 113;
pub const _SC_SHRT_MIN: _bindgen_ty_2 = 114;
pub const _SC_UCHAR_MAX: _bindgen_ty_2 = 115;
pub const _SC_UINT_MAX: _bindgen_ty_2 = 116;
pub const _SC_ULONG_MAX: _bindgen_ty_2 = 117;
pub const _SC_USHRT_MAX: _bindgen_ty_2 = 118;
pub const _SC_NL_ARGMAX: _bindgen_ty_2 = 119;
pub const _SC_NL_LANGMAX: _bindgen_ty_2 = 120;
pub const _SC_NL_MSGMAX: _bindgen_ty_2 = 121;
pub const _SC_NL_NMAX: _bindgen_ty_2 = 122;
pub const _SC_NL_SETMAX: _bindgen_ty_2 = 123;
pub const _SC_NL_TEXTMAX: _bindgen_ty_2 = 124;
pub const _SC_XBS5_ILP32_OFF32: _bindgen_ty_2 = 125;
pub const _SC_XBS5_ILP32_OFFBIG: _bindgen_ty_2 = 126;
pub const _SC_XBS5_LP64_OFF64: _bindgen_ty_2 = 127;
pub const _SC_XBS5_LPBIG_OFFBIG: _bindgen_ty_2 = 128;
pub const _SC_XOPEN_LEGACY: _bindgen_ty_2 = 129;
pub const _SC_XOPEN_REALTIME: _bindgen_ty_2 = 130;
pub const _SC_XOPEN_REALTIME_THREADS: _bindgen_ty_2 = 131;
pub const _SC_ADVISORY_INFO: _bindgen_ty_2 = 132;
pub const _SC_BARRIERS: _bindgen_ty_2 = 133;
pub const _SC_BASE: _bindgen_ty_2 = 134;
pub const _SC_C_LANG_SUPPORT: _bindgen_ty_2 = 135;
pub const _SC_C_LANG_SUPPORT_R: _bindgen_ty_2 = 136;
pub const _SC_CLOCK_SELECTION: _bindgen_ty_2 = 137;
pub const _SC_CPUTIME: _bindgen_ty_2 = 138;
pub const _SC_THREAD_CPUTIME: _bindgen_ty_2 = 139;
pub const _SC_DEVICE_IO: _bindgen_ty_2 = 140;
pub const _SC_DEVICE_SPECIFIC: _bindgen_ty_2 = 141;
pub const _SC_DEVICE_SPECIFIC_R: _bindgen_ty_2 = 142;
pub const _SC_FD_MGMT: _bindgen_ty_2 = 143;
pub const _SC_FIFO: _bindgen_ty_2 = 144;
pub const _SC_PIPE: _bindgen_ty_2 = 145;
pub const _SC_FILE_ATTRIBUTES: _bindgen_ty_2 = 146;
pub const _SC_FILE_LOCKING: _bindgen_ty_2 = 147;
pub const _SC_FILE_SYSTEM: _bindgen_ty_2 = 148;
pub const _SC_MONOTONIC_CLOCK: _bindgen_ty_2 = 149;
pub const _SC_MULTI_PROCESS: _bindgen_ty_2 = 150;
pub const _SC_SINGLE_PROCESS: _bindgen_ty_2 = 151;
pub const _SC_NETWORKING: _bindgen_ty_2 = 152;
pub const _SC_READER_WRITER_LOCKS: _bindgen_ty_2 = 153;
pub const _SC_SPIN_LOCKS: _bindgen_ty_2 = 154;
pub const _SC_REGEXP: _bindgen_ty_2 = 155;
pub const _SC_REGEX_VERSION: _bindgen_ty_2 = 156;
pub const _SC_SHELL: _bindgen_ty_2 = 157;
pub const _SC_SIGNALS: _bindgen_ty_2 = 158;
pub const _SC_SPAWN: _bindgen_ty_2 = 159;
pub const _SC_SPORADIC_SERVER: _bindgen_ty_2 = 160;
pub const _SC_THREAD_SPORADIC_SERVER: _bindgen_ty_2 = 161;
pub const _SC_SYSTEM_DATABASE: _bindgen_ty_2 = 162;
pub const _SC_SYSTEM_DATABASE_R: _bindgen_ty_2 = 163;
pub const _SC_TIMEOUTS: _bindgen_ty_2 = 164;
pub const _SC_TYPED_MEMORY_OBJECTS: _bindgen_ty_2 = 165;
pub const _SC_USER_GROUPS: _bindgen_ty_2 = 166;
pub const _SC_USER_GROUPS_R: _bindgen_ty_2 = 167;
pub const _SC_2_PBS: _bindgen_ty_2 = 168;
pub const _SC_2_PBS_ACCOUNTING: _bindgen_ty_2 = 169;
pub const _SC_2_PBS_LOCATE: _bindgen_ty_2 = 170;
pub const _SC_2_PBS_MESSAGE: _bindgen_ty_2 = 171;
pub const _SC_2_PBS_TRACK: _bindgen_ty_2 = 172;
pub const _SC_SYMLOOP_MAX: _bindgen_ty_2 = 173;
pub const _SC_STREAMS: _bindgen_ty_2 = 174;
pub const _SC_2_PBS_CHECKPOINT: _bindgen_ty_2 = 175;
pub const _SC_V6_ILP32_OFF32: _bindgen_ty_2 = 176;
pub const _SC_V6_ILP32_OFFBIG: _bindgen_ty_2 = 177;
pub const _SC_V6_LP64_OFF64: _bindgen_ty_2 = 178;
pub const _SC_V6_LPBIG_OFFBIG: _bindgen_ty_2 = 179;
pub const _SC_HOST_NAME_MAX: _bindgen_ty_2 = 180;
pub const _SC_TRACE: _bindgen_ty_2 = 181;
pub const _SC_TRACE_EVENT_FILTER: _bindgen_ty_2 = 182;
pub const _SC_TRACE_INHERIT: _bindgen_ty_2 = 183;
pub const _SC_TRACE_LOG: _bindgen_ty_2 = 184;
pub const _SC_LEVEL1_ICACHE_SIZE: _bindgen_ty_2 = 185;
pub const _SC_LEVEL1_ICACHE_ASSOC: _bindgen_ty_2 = 186;
pub const _SC_LEVEL1_ICACHE_LINESIZE: _bindgen_ty_2 = 187;
pub const _SC_LEVEL1_DCACHE_SIZE: _bindgen_ty_2 = 188;
pub const _SC_LEVEL1_DCACHE_ASSOC: _bindgen_ty_2 = 189;
pub const _SC_LEVEL1_DCACHE_LINESIZE: _bindgen_ty_2 = 190;
pub const _SC_LEVEL2_CACHE_SIZE: _bindgen_ty_2 = 191;
pub const _SC_LEVEL2_CACHE_ASSOC: _bindgen_ty_2 = 192;
pub const _SC_LEVEL2_CACHE_LINESIZE: _bindgen_ty_2 = 193;
pub const _SC_LEVEL3_CACHE_SIZE: _bindgen_ty_2 = 194;
pub const _SC_LEVEL3_CACHE_ASSOC: _bindgen_ty_2 = 195;
pub const _SC_LEVEL3_CACHE_LINESIZE: _bindgen_ty_2 = 196;
pub const _SC_LEVEL4_CACHE_SIZE: _bindgen_ty_2 = 197;
pub const _SC_LEVEL4_CACHE_ASSOC: _bindgen_ty_2 = 198;
pub const _SC_LEVEL4_CACHE_LINESIZE: _bindgen_ty_2 = 199;
pub const _SC_IPV6: _bindgen_ty_2 = 235;
pub const _SC_RAW_SOCKETS: _bindgen_ty_2 = 236;
pub const _SC_V7_ILP32_OFF32: _bindgen_ty_2 = 237;
pub const _SC_V7_ILP32_OFFBIG: _bindgen_ty_2 = 238;
pub const _SC_V7_LP64_OFF64: _bindgen_ty_2 = 239;
pub const _SC_V7_LPBIG_OFFBIG: _bindgen_ty_2 = 240;
pub const _SC_SS_REPL_MAX: _bindgen_ty_2 = 241;
pub const _SC_TRACE_EVENT_NAME_MAX: _bindgen_ty_2 = 242;
pub const _SC_TRACE_NAME_MAX: _bindgen_ty_2 = 243;
pub const _SC_TRACE_SYS_MAX: _bindgen_ty_2 = 244;
pub const _SC_TRACE_USER_EVENT_MAX: _bindgen_ty_2 = 245;
pub const _SC_XOPEN_STREAMS: _bindgen_ty_2 = 246;
pub const _SC_THREAD_ROBUST_PRIO_INHERIT: _bindgen_ty_2 = 247;
pub const _SC_THREAD_ROBUST_PRIO_PROTECT: _bindgen_ty_2 = 248;
pub type _bindgen_ty_2 = u32;
pub const _CS_PATH: _bindgen_ty_3 = 0;
pub const _CS_V6_WIDTH_RESTRICTED_ENVS: _bindgen_ty_3 = 1;
pub const _CS_GNU_LIBC_VERSION: _bindgen_ty_3 = 2;
pub const _CS_GNU_LIBPTHREAD_VERSION: _bindgen_ty_3 = 3;
pub const _CS_V5_WIDTH_RESTRICTED_ENVS: _bindgen_ty_3 = 4;
pub const _CS_V7_WIDTH_RESTRICTED_ENVS: _bindgen_ty_3 = 5;
pub const _CS_LFS_CFLAGS: _bindgen_ty_3 = 1000;
pub const _CS_LFS_LDFLAGS: _bindgen_ty_3 = 1001;
pub const _CS_LFS_LIBS: _bindgen_ty_3 = 1002;
pub const _CS_LFS_LINTFLAGS: _bindgen_ty_3 = 1003;
pub const _CS_LFS64_CFLAGS: _bindgen_ty_3 = 1004;
pub const _CS_LFS64_LDFLAGS: _bindgen_ty_3 = 1005;
pub const _CS_LFS64_LIBS: _bindgen_ty_3 = 1006;
pub const _CS_LFS64_LINTFLAGS: _bindgen_ty_3 = 1007;
pub const _CS_XBS5_ILP32_OFF32_CFLAGS: _bindgen_ty_3 = 1100;
pub const _CS_XBS5_ILP32_OFF32_LDFLAGS: _bindgen_ty_3 = 1101;
pub const _CS_XBS5_ILP32_OFF32_LIBS: _bindgen_ty_3 = 1102;
pub const _CS_XBS5_ILP32_OFF32_LINTFLAGS: _bindgen_ty_3 = 1103;
pub const _CS_XBS5_ILP32_OFFBIG_CFLAGS: _bindgen_ty_3 = 1104;
pub const _CS_XBS5_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_3 = 1105;
pub const _CS_XBS5_ILP32_OFFBIG_LIBS: _bindgen_ty_3 = 1106;
pub const _CS_XBS5_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_3 = 1107;
pub const _CS_XBS5_LP64_OFF64_CFLAGS: _bindgen_ty_3 = 1108;
pub const _CS_XBS5_LP64_OFF64_LDFLAGS: _bindgen_ty_3 = 1109;
pub const _CS_XBS5_LP64_OFF64_LIBS: _bindgen_ty_3 = 1110;
pub const _CS_XBS5_LP64_OFF64_LINTFLAGS: _bindgen_ty_3 = 1111;
pub const _CS_XBS5_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_3 = 1112;
pub const _CS_XBS5_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_3 = 1113;
pub const _CS_XBS5_LPBIG_OFFBIG_LIBS: _bindgen_ty_3 = 1114;
pub const _CS_XBS5_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_3 = 1115;
pub const _CS_POSIX_V6_ILP32_OFF32_CFLAGS: _bindgen_ty_3 = 1116;
pub const _CS_POSIX_V6_ILP32_OFF32_LDFLAGS: _bindgen_ty_3 = 1117;
pub const _CS_POSIX_V6_ILP32_OFF32_LIBS: _bindgen_ty_3 = 1118;
pub const _CS_POSIX_V6_ILP32_OFF32_LINTFLAGS: _bindgen_ty_3 = 1119;
pub const _CS_POSIX_V6_ILP32_OFFBIG_CFLAGS: _bindgen_ty_3 = 1120;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_3 = 1121;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LIBS: _bindgen_ty_3 = 1122;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_3 = 1123;
pub const _CS_POSIX_V6_LP64_OFF64_CFLAGS: _bindgen_ty_3 = 1124;
pub const _CS_POSIX_V6_LP64_OFF64_LDFLAGS: _bindgen_ty_3 = 1125;
pub const _CS_POSIX_V6_LP64_OFF64_LIBS: _bindgen_ty_3 = 1126;
pub const _CS_POSIX_V6_LP64_OFF64_LINTFLAGS: _bindgen_ty_3 = 1127;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_3 = 1128;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_3 = 1129;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LIBS: _bindgen_ty_3 = 1130;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_3 = 1131;
pub const _CS_POSIX_V7_ILP32_OFF32_CFLAGS: _bindgen_ty_3 = 1132;
pub const _CS_POSIX_V7_ILP32_OFF32_LDFLAGS: _bindgen_ty_3 = 1133;
pub const _CS_POSIX_V7_ILP32_OFF32_LIBS: _bindgen_ty_3 = 1134;
pub const _CS_POSIX_V7_ILP32_OFF32_LINTFLAGS: _bindgen_ty_3 = 1135;
pub const _CS_POSIX_V7_ILP32_OFFBIG_CFLAGS: _bindgen_ty_3 = 1136;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_3 = 1137;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LIBS: _bindgen_ty_3 = 1138;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_3 = 1139;
pub const _CS_POSIX_V7_LP64_OFF64_CFLAGS: _bindgen_ty_3 = 1140;
pub const _CS_POSIX_V7_LP64_OFF64_LDFLAGS: _bindgen_ty_3 = 1141;
pub const _CS_POSIX_V7_LP64_OFF64_LIBS: _bindgen_ty_3 = 1142;
pub const _CS_POSIX_V7_LP64_OFF64_LINTFLAGS: _bindgen_ty_3 = 1143;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_3 = 1144;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_3 = 1145;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_LIBS: _bindgen_ty_3 = 1146;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_3 = 1147;
pub const _CS_V6_ENV: _bindgen_ty_3 = 1148;
pub const _CS_V7_ENV: _bindgen_ty_3 = 1149;
pub type _bindgen_ty_3 = u32;
extern "C" {
    pub fn pathconf(
        __path: *const ::std::os::raw::c_char,
        __name: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn fpathconf(
        __fd: ::std::os::raw::c_int,
        __name: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn sysconf(__name: ::std::os::raw::c_int) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn confstr(
        __name: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> usize;
}
extern "C" {
    pub fn getpid() -> __pid_t;
}
extern "C" {
    pub fn getppid() -> __pid_t;
}
extern "C" {
    pub fn getpgrp() -> __pid_t;
}
extern "C" {
    pub fn __getpgid(__pid: __pid_t) -> __pid_t;
}
extern "C" {
    pub fn getpgid(__pid: __pid_t) -> __pid_t;
}
extern "C" {
    pub fn setpgid(__pid: __pid_t, __pgid: __pid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setpgrp() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setsid() -> __pid_t;
}
extern "C" {
    pub fn getsid(__pid: __pid_t) -> __pid_t;
}
extern "C" {
    pub fn getuid() -> __uid_t;
}
extern "C" {
    pub fn geteuid() -> __uid_t;
}
extern "C" {
    pub fn getgid() -> __gid_t;
}
extern "C" {
    pub fn getegid() -> __gid_t;
}
extern "C" {
    pub fn getgroups(__size: ::std::os::raw::c_int, __list: *mut __gid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setuid(__uid: __uid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setreuid(__ruid: __uid_t, __euid: __uid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seteuid(__uid: __uid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setgid(__gid: __gid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setregid(__rgid: __gid_t, __egid: __gid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setegid(__gid: __gid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fork() -> __pid_t;
}
extern "C" {
    pub fn vfork() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ttyname(__fd: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ttyname_r(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isatty(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ttyslot() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn link(
        __from: *const ::std::os::raw::c_char,
        __to: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn linkat(
        __fromfd: ::std::os::raw::c_int,
        __from: *const ::std::os::raw::c_char,
        __tofd: ::std::os::raw::c_int,
        __to: *const ::std::os::raw::c_char,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn symlink(
        __from: *const ::std::os::raw::c_char,
        __to: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn readlink(
        __path: *const ::std::os::raw::c_char,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> isize;
}
extern "C" {
    pub fn symlinkat(
        __from: *const ::std::os::raw::c_char,
        __tofd: ::std::os::raw::c_int,
        __to: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn readlinkat(
        __fd: ::std::os::raw::c_int,
        __path: *const ::std::os::raw::c_char,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> isize;
}
extern "C" {
    pub fn unlink(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unlinkat(
        __fd: ::std::os::raw::c_int,
        __name: *const ::std::os::raw::c_char,
        __flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rmdir(__path: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tcgetpgrp(__fd: ::std::os::raw::c_int) -> __pid_t;
}
extern "C" {
    pub fn tcsetpgrp(__fd: ::std::os::raw::c_int, __pgrp_id: __pid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getlogin() -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn getlogin_r(
        __name: *mut ::std::os::raw::c_char,
        __name_len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setlogin(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub static mut optarg: *mut ::std::os::raw::c_char;
}
extern "C" {
    pub static mut optind: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut opterr: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut optopt: ::std::os::raw::c_int;
}
extern "C" {
    pub fn getopt(
        ___argc: ::std::os::raw::c_int,
        ___argv: *const *mut ::std::os::raw::c_char,
        __shortopts: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gethostname(__name: *mut ::std::os::raw::c_char, __len: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sethostname(
        __name: *const ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sethostid(__id: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getdomainname(
        __name: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setdomainname(
        __name: *const ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vhangup() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn revoke(__file: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn profil(
        __sample_buffer: *mut ::std::os::raw::c_ushort,
        __size: usize,
        __offset: usize,
        __scale: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn acct(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getusershell() -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn endusershell();
}
extern "C" {
    pub fn setusershell();
}
extern "C" {
    pub fn daemon(
        __nochdir: ::std::os::raw::c_int,
        __noclose: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn chroot(__path: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getpass(__prompt: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fsync(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gethostid() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn sync();
}
extern "C" {
    pub fn getpagesize() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getdtablesize() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn truncate(
        __file: *const ::std::os::raw::c_char,
        __length: __off_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftruncate(__fd: ::std::os::raw::c_int, __length: __off_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn brk(__addr: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sbrk(__delta: isize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn syscall(__sysno: ::std::os::raw::c_long, ...) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn lockf(
        __fd: ::std::os::raw::c_int,
        __cmd: ::std::os::raw::c_int,
        __len: __off_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fdatasync(__fildes: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn crypt(
        __key: *const ::std::os::raw::c_char,
        __salt: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn getentropy(
        __buffer: *mut ::std::os::raw::c_void,
        __length: usize,
    ) -> ::std::os::raw::c_int;
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wch as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wchb as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__value as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._markers as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._chain as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._lock as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._offset as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._codecvt as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_codecvt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._wide_data as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_wide_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_list as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_buf as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._mode as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
pub type fpos_t = __fpos_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: usize,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    pub static mut sys_nerr: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iret_context {
    pub rax: u64,
    pub r11: u64,
    pub rcx: u64,
    pub flags: u64,
    pub rip: u64,
    pub cs: u64,
    pub rflags: u64,
    pub rsp: u64,
    pub ss: u64,
}
#[test]
fn bindgen_test_layout_iret_context() {
    assert_eq!(
        ::std::mem::size_of::<iret_context>(),
        72usize,
        concat!("Size of: ", stringify!(iret_context))
    );
    assert_eq!(
        ::std::mem::align_of::<iret_context>(),
        8usize,
        concat!("Alignment of ", stringify!(iret_context))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<iret_context>())).rax as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iret_context),
            "::",
            stringify!(rax)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<iret_context>())).r11 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iret_context),
            "::",
            stringify!(r11)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<iret_context>())).rcx as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(iret_context),
            "::",
            stringify!(rcx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<iret_context>())).flags as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(iret_context),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<iret_context>())).rip as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(iret_context),
            "::",
            stringify!(rip)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<iret_context>())).cs as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(iret_context),
            "::",
            stringify!(cs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<iret_context>())).rflags as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(iret_context),
            "::",
            stringify!(rflags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<iret_context>())).rsp as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(iret_context),
            "::",
            stringify!(rsp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<iret_context>())).ss as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(iret_context),
            "::",
            stringify!(ss)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cpu_user_regs {
    pub __bindgen_anon_1: cpu_user_regs__bindgen_ty_1,
    pub __bindgen_anon_2: cpu_user_regs__bindgen_ty_2,
    pub __bindgen_anon_3: cpu_user_regs__bindgen_ty_3,
    pub __bindgen_anon_4: cpu_user_regs__bindgen_ty_4,
    pub __bindgen_anon_5: cpu_user_regs__bindgen_ty_5,
    pub __bindgen_anon_6: cpu_user_regs__bindgen_ty_6,
    pub __bindgen_anon_7: cpu_user_regs__bindgen_ty_7,
    pub __bindgen_anon_8: cpu_user_regs__bindgen_ty_8,
    pub __bindgen_anon_9: cpu_user_regs__bindgen_ty_9,
    pub __bindgen_anon_10: cpu_user_regs__bindgen_ty_10,
    pub __bindgen_anon_11: cpu_user_regs__bindgen_ty_11,
    pub __bindgen_anon_12: cpu_user_regs__bindgen_ty_12,
    pub __bindgen_anon_13: cpu_user_regs__bindgen_ty_13,
    pub __bindgen_anon_14: cpu_user_regs__bindgen_ty_14,
    pub __bindgen_anon_15: cpu_user_regs__bindgen_ty_15,
    pub error_code: u32,
    pub entry_vector: u32,
    pub __bindgen_anon_16: cpu_user_regs__bindgen_ty_16,
    pub cs: u16,
    pub _pad0: [u16; 1usize],
    pub saved_upcall_mask: u8,
    pub _pad1: [u8; 3usize],
    pub __bindgen_anon_17: cpu_user_regs__bindgen_ty_17,
    pub __bindgen_anon_18: cpu_user_regs__bindgen_ty_18,
    pub ss: u16,
    pub _pad2: [u16; 3usize],
    pub es: u16,
    pub _pad3: [u16; 3usize],
    pub ds: u16,
    pub _pad4: [u16; 3usize],
    pub fs: u16,
    pub _pad5: [u16; 3usize],
    pub gs: u16,
    pub _pad6: [u16; 3usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_1 {
    pub r15: u64,
    pub r15d: u32,
    pub r15w: u16,
    pub r15b: u8,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_cpu_user_regs__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<cpu_user_regs__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(cpu_user_regs__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_user_regs__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(cpu_user_regs__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_1>())).r15 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_1),
            "::",
            stringify!(r15)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_1>())).r15d as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_1),
            "::",
            stringify!(r15d)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_1>())).r15w as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_1),
            "::",
            stringify!(r15w)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_1>())).r15b as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_1),
            "::",
            stringify!(r15b)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_2 {
    pub r14: u64,
    pub r14d: u32,
    pub r14w: u16,
    pub r14b: u8,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_cpu_user_regs__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<cpu_user_regs__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(cpu_user_regs__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_user_regs__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(cpu_user_regs__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_2>())).r14 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_2),
            "::",
            stringify!(r14)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_2>())).r14d as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_2),
            "::",
            stringify!(r14d)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_2>())).r14w as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_2),
            "::",
            stringify!(r14w)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_2>())).r14b as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_2),
            "::",
            stringify!(r14b)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_3 {
    pub r13: u64,
    pub r13d: u32,
    pub r13w: u16,
    pub r13b: u8,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_cpu_user_regs__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<cpu_user_regs__bindgen_ty_3>(),
        8usize,
        concat!("Size of: ", stringify!(cpu_user_regs__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_user_regs__bindgen_ty_3>(),
        8usize,
        concat!("Alignment of ", stringify!(cpu_user_regs__bindgen_ty_3))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_3>())).r13 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_3),
            "::",
            stringify!(r13)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_3>())).r13d as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_3),
            "::",
            stringify!(r13d)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_3>())).r13w as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_3),
            "::",
            stringify!(r13w)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_3>())).r13b as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_3),
            "::",
            stringify!(r13b)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_4 {
    pub r12: u64,
    pub r12d: u32,
    pub r12w: u16,
    pub r12b: u8,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_cpu_user_regs__bindgen_ty_4() {
    assert_eq!(
        ::std::mem::size_of::<cpu_user_regs__bindgen_ty_4>(),
        8usize,
        concat!("Size of: ", stringify!(cpu_user_regs__bindgen_ty_4))
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_user_regs__bindgen_ty_4>(),
        8usize,
        concat!("Alignment of ", stringify!(cpu_user_regs__bindgen_ty_4))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_4>())).r12 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_4),
            "::",
            stringify!(r12)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_4>())).r12d as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_4),
            "::",
            stringify!(r12d)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_4>())).r12w as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_4),
            "::",
            stringify!(r12w)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_4>())).r12b as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_4),
            "::",
            stringify!(r12b)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_5 {
    pub rbp: u64,
    pub ebp: u32,
    pub bp: u16,
    pub bpl: u8,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_cpu_user_regs__bindgen_ty_5() {
    assert_eq!(
        ::std::mem::size_of::<cpu_user_regs__bindgen_ty_5>(),
        8usize,
        concat!("Size of: ", stringify!(cpu_user_regs__bindgen_ty_5))
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_user_regs__bindgen_ty_5>(),
        8usize,
        concat!("Alignment of ", stringify!(cpu_user_regs__bindgen_ty_5))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_5>())).rbp as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_5),
            "::",
            stringify!(rbp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_5>())).ebp as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_5),
            "::",
            stringify!(ebp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_5>())).bp as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_5),
            "::",
            stringify!(bp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_5>())).bpl as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_5),
            "::",
            stringify!(bpl)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_6 {
    pub rbx: u64,
    pub ebx: u32,
    pub bx: u16,
    pub __bindgen_anon_1: cpu_user_regs__bindgen_ty_6__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cpu_user_regs__bindgen_ty_6__bindgen_ty_1 {
    pub bl: u8,
    pub bh: u8,
}
#[test]
fn bindgen_test_layout_cpu_user_regs__bindgen_ty_6__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<cpu_user_regs__bindgen_ty_6__bindgen_ty_1>(),
        2usize,
        concat!(
            "Size of: ",
            stringify!(cpu_user_regs__bindgen_ty_6__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_user_regs__bindgen_ty_6__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(cpu_user_regs__bindgen_ty_6__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_6__bindgen_ty_1>())).bl as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_6__bindgen_ty_1),
            "::",
            stringify!(bl)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_6__bindgen_ty_1>())).bh as *const _
                as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_6__bindgen_ty_1),
            "::",
            stringify!(bh)
        )
    );
}
#[test]
fn bindgen_test_layout_cpu_user_regs__bindgen_ty_6() {
    assert_eq!(
        ::std::mem::size_of::<cpu_user_regs__bindgen_ty_6>(),
        8usize,
        concat!("Size of: ", stringify!(cpu_user_regs__bindgen_ty_6))
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_user_regs__bindgen_ty_6>(),
        8usize,
        concat!("Alignment of ", stringify!(cpu_user_regs__bindgen_ty_6))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_6>())).rbx as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_6),
            "::",
            stringify!(rbx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_6>())).ebx as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_6),
            "::",
            stringify!(ebx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_6>())).bx as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_6),
            "::",
            stringify!(bx)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_7 {
    pub r11: u64,
    pub r11d: u32,
    pub r11w: u16,
    pub r11b: u8,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_cpu_user_regs__bindgen_ty_7() {
    assert_eq!(
        ::std::mem::size_of::<cpu_user_regs__bindgen_ty_7>(),
        8usize,
        concat!("Size of: ", stringify!(cpu_user_regs__bindgen_ty_7))
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_user_regs__bindgen_ty_7>(),
        8usize,
        concat!("Alignment of ", stringify!(cpu_user_regs__bindgen_ty_7))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_7>())).r11 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_7),
            "::",
            stringify!(r11)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_7>())).r11d as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_7),
            "::",
            stringify!(r11d)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_7>())).r11w as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_7),
            "::",
            stringify!(r11w)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_7>())).r11b as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_7),
            "::",
            stringify!(r11b)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_8 {
    pub r10: u64,
    pub r10d: u32,
    pub r10w: u16,
    pub r10b: u8,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_cpu_user_regs__bindgen_ty_8() {
    assert_eq!(
        ::std::mem::size_of::<cpu_user_regs__bindgen_ty_8>(),
        8usize,
        concat!("Size of: ", stringify!(cpu_user_regs__bindgen_ty_8))
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_user_regs__bindgen_ty_8>(),
        8usize,
        concat!("Alignment of ", stringify!(cpu_user_regs__bindgen_ty_8))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_8>())).r10 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_8),
            "::",
            stringify!(r10)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_8>())).r10d as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_8),
            "::",
            stringify!(r10d)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_8>())).r10w as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_8),
            "::",
            stringify!(r10w)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_8>())).r10b as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_8),
            "::",
            stringify!(r10b)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_9 {
    pub r9: u64,
    pub r9d: u32,
    pub r9w: u16,
    pub r9b: u8,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_cpu_user_regs__bindgen_ty_9() {
    assert_eq!(
        ::std::mem::size_of::<cpu_user_regs__bindgen_ty_9>(),
        8usize,
        concat!("Size of: ", stringify!(cpu_user_regs__bindgen_ty_9))
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_user_regs__bindgen_ty_9>(),
        8usize,
        concat!("Alignment of ", stringify!(cpu_user_regs__bindgen_ty_9))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_9>())).r9 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_9),
            "::",
            stringify!(r9)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_9>())).r9d as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_9),
            "::",
            stringify!(r9d)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_9>())).r9w as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_9),
            "::",
            stringify!(r9w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_9>())).r9b as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_9),
            "::",
            stringify!(r9b)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_10 {
    pub r8: u64,
    pub r8d: u32,
    pub r8w: u16,
    pub r8b: u8,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_cpu_user_regs__bindgen_ty_10() {
    assert_eq!(
        ::std::mem::size_of::<cpu_user_regs__bindgen_ty_10>(),
        8usize,
        concat!("Size of: ", stringify!(cpu_user_regs__bindgen_ty_10))
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_user_regs__bindgen_ty_10>(),
        8usize,
        concat!("Alignment of ", stringify!(cpu_user_regs__bindgen_ty_10))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_10>())).r8 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_10),
            "::",
            stringify!(r8)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_10>())).r8d as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_10),
            "::",
            stringify!(r8d)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_10>())).r8w as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_10),
            "::",
            stringify!(r8w)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_10>())).r8b as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_10),
            "::",
            stringify!(r8b)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_11 {
    pub rax: u64,
    pub eax: u32,
    pub ax: u16,
    pub __bindgen_anon_1: cpu_user_regs__bindgen_ty_11__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cpu_user_regs__bindgen_ty_11__bindgen_ty_1 {
    pub al: u8,
    pub ah: u8,
}
#[test]
fn bindgen_test_layout_cpu_user_regs__bindgen_ty_11__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<cpu_user_regs__bindgen_ty_11__bindgen_ty_1>(),
        2usize,
        concat!(
            "Size of: ",
            stringify!(cpu_user_regs__bindgen_ty_11__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_user_regs__bindgen_ty_11__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(cpu_user_regs__bindgen_ty_11__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_11__bindgen_ty_1>())).al as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_11__bindgen_ty_1),
            "::",
            stringify!(al)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_11__bindgen_ty_1>())).ah as *const _
                as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_11__bindgen_ty_1),
            "::",
            stringify!(ah)
        )
    );
}
#[test]
fn bindgen_test_layout_cpu_user_regs__bindgen_ty_11() {
    assert_eq!(
        ::std::mem::size_of::<cpu_user_regs__bindgen_ty_11>(),
        8usize,
        concat!("Size of: ", stringify!(cpu_user_regs__bindgen_ty_11))
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_user_regs__bindgen_ty_11>(),
        8usize,
        concat!("Alignment of ", stringify!(cpu_user_regs__bindgen_ty_11))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_11>())).rax as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_11),
            "::",
            stringify!(rax)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_11>())).eax as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_11),
            "::",
            stringify!(eax)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_11>())).ax as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_11),
            "::",
            stringify!(ax)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_12 {
    pub rcx: u64,
    pub ecx: u32,
    pub cx: u16,
    pub __bindgen_anon_1: cpu_user_regs__bindgen_ty_12__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cpu_user_regs__bindgen_ty_12__bindgen_ty_1 {
    pub cl: u8,
    pub ch: u8,
}
#[test]
fn bindgen_test_layout_cpu_user_regs__bindgen_ty_12__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<cpu_user_regs__bindgen_ty_12__bindgen_ty_1>(),
        2usize,
        concat!(
            "Size of: ",
            stringify!(cpu_user_regs__bindgen_ty_12__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_user_regs__bindgen_ty_12__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(cpu_user_regs__bindgen_ty_12__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_12__bindgen_ty_1>())).cl as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_12__bindgen_ty_1),
            "::",
            stringify!(cl)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_12__bindgen_ty_1>())).ch as *const _
                as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_12__bindgen_ty_1),
            "::",
            stringify!(ch)
        )
    );
}
#[test]
fn bindgen_test_layout_cpu_user_regs__bindgen_ty_12() {
    assert_eq!(
        ::std::mem::size_of::<cpu_user_regs__bindgen_ty_12>(),
        8usize,
        concat!("Size of: ", stringify!(cpu_user_regs__bindgen_ty_12))
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_user_regs__bindgen_ty_12>(),
        8usize,
        concat!("Alignment of ", stringify!(cpu_user_regs__bindgen_ty_12))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_12>())).rcx as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_12),
            "::",
            stringify!(rcx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_12>())).ecx as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_12),
            "::",
            stringify!(ecx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_12>())).cx as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_12),
            "::",
            stringify!(cx)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_13 {
    pub rdx: u64,
    pub edx: u32,
    pub dx: u16,
    pub __bindgen_anon_1: cpu_user_regs__bindgen_ty_13__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cpu_user_regs__bindgen_ty_13__bindgen_ty_1 {
    pub dl: u8,
    pub dh: u8,
}
#[test]
fn bindgen_test_layout_cpu_user_regs__bindgen_ty_13__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<cpu_user_regs__bindgen_ty_13__bindgen_ty_1>(),
        2usize,
        concat!(
            "Size of: ",
            stringify!(cpu_user_regs__bindgen_ty_13__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_user_regs__bindgen_ty_13__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(cpu_user_regs__bindgen_ty_13__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_13__bindgen_ty_1>())).dl as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_13__bindgen_ty_1),
            "::",
            stringify!(dl)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_13__bindgen_ty_1>())).dh as *const _
                as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_13__bindgen_ty_1),
            "::",
            stringify!(dh)
        )
    );
}
#[test]
fn bindgen_test_layout_cpu_user_regs__bindgen_ty_13() {
    assert_eq!(
        ::std::mem::size_of::<cpu_user_regs__bindgen_ty_13>(),
        8usize,
        concat!("Size of: ", stringify!(cpu_user_regs__bindgen_ty_13))
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_user_regs__bindgen_ty_13>(),
        8usize,
        concat!("Alignment of ", stringify!(cpu_user_regs__bindgen_ty_13))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_13>())).rdx as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_13),
            "::",
            stringify!(rdx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_13>())).edx as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_13),
            "::",
            stringify!(edx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_13>())).dx as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_13),
            "::",
            stringify!(dx)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_14 {
    pub rsi: u64,
    pub esi: u32,
    pub si: u16,
    pub sil: u8,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_cpu_user_regs__bindgen_ty_14() {
    assert_eq!(
        ::std::mem::size_of::<cpu_user_regs__bindgen_ty_14>(),
        8usize,
        concat!("Size of: ", stringify!(cpu_user_regs__bindgen_ty_14))
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_user_regs__bindgen_ty_14>(),
        8usize,
        concat!("Alignment of ", stringify!(cpu_user_regs__bindgen_ty_14))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_14>())).rsi as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_14),
            "::",
            stringify!(rsi)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_14>())).esi as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_14),
            "::",
            stringify!(esi)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_14>())).si as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_14),
            "::",
            stringify!(si)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_14>())).sil as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_14),
            "::",
            stringify!(sil)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_15 {
    pub rdi: u64,
    pub edi: u32,
    pub di: u16,
    pub dil: u8,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_cpu_user_regs__bindgen_ty_15() {
    assert_eq!(
        ::std::mem::size_of::<cpu_user_regs__bindgen_ty_15>(),
        8usize,
        concat!("Size of: ", stringify!(cpu_user_regs__bindgen_ty_15))
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_user_regs__bindgen_ty_15>(),
        8usize,
        concat!("Alignment of ", stringify!(cpu_user_regs__bindgen_ty_15))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_15>())).rdi as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_15),
            "::",
            stringify!(rdi)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_15>())).edi as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_15),
            "::",
            stringify!(edi)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_15>())).di as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_15),
            "::",
            stringify!(di)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_15>())).dil as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_15),
            "::",
            stringify!(dil)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_16 {
    pub rip: u64,
    pub eip: u32,
    pub ip: u16,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_cpu_user_regs__bindgen_ty_16() {
    assert_eq!(
        ::std::mem::size_of::<cpu_user_regs__bindgen_ty_16>(),
        8usize,
        concat!("Size of: ", stringify!(cpu_user_regs__bindgen_ty_16))
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_user_regs__bindgen_ty_16>(),
        8usize,
        concat!("Alignment of ", stringify!(cpu_user_regs__bindgen_ty_16))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_16>())).rip as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_16),
            "::",
            stringify!(rip)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_16>())).eip as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_16),
            "::",
            stringify!(eip)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_16>())).ip as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_16),
            "::",
            stringify!(ip)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_17 {
    pub rflags: u64,
    pub eflags: u32,
    pub flags: u16,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_cpu_user_regs__bindgen_ty_17() {
    assert_eq!(
        ::std::mem::size_of::<cpu_user_regs__bindgen_ty_17>(),
        8usize,
        concat!("Size of: ", stringify!(cpu_user_regs__bindgen_ty_17))
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_user_regs__bindgen_ty_17>(),
        8usize,
        concat!("Alignment of ", stringify!(cpu_user_regs__bindgen_ty_17))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_17>())).rflags as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_17),
            "::",
            stringify!(rflags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_17>())).eflags as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_17),
            "::",
            stringify!(eflags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_17>())).flags as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_17),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_18 {
    pub rsp: u64,
    pub esp: u32,
    pub sp: u16,
    pub spl: u8,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_cpu_user_regs__bindgen_ty_18() {
    assert_eq!(
        ::std::mem::size_of::<cpu_user_regs__bindgen_ty_18>(),
        8usize,
        concat!("Size of: ", stringify!(cpu_user_regs__bindgen_ty_18))
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_user_regs__bindgen_ty_18>(),
        8usize,
        concat!("Alignment of ", stringify!(cpu_user_regs__bindgen_ty_18))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_18>())).rsp as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_18),
            "::",
            stringify!(rsp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_18>())).esp as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_18),
            "::",
            stringify!(esp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_18>())).sp as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_18),
            "::",
            stringify!(sp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cpu_user_regs__bindgen_ty_18>())).spl as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs__bindgen_ty_18),
            "::",
            stringify!(spl)
        )
    );
}
#[test]
fn bindgen_test_layout_cpu_user_regs() {
    assert_eq!(
        ::std::mem::size_of::<cpu_user_regs>(),
        200usize,
        concat!("Size of: ", stringify!(cpu_user_regs))
    );
    assert_eq!(
        ::std::mem::align_of::<cpu_user_regs>(),
        8usize,
        concat!("Alignment of ", stringify!(cpu_user_regs))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs>())).error_code as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs),
            "::",
            stringify!(error_code)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs>())).entry_vector as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs),
            "::",
            stringify!(entry_vector)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs>())).cs as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs),
            "::",
            stringify!(cs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs>()))._pad0 as *const _ as usize },
        138usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs),
            "::",
            stringify!(_pad0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs>())).saved_upcall_mask as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs),
            "::",
            stringify!(saved_upcall_mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs>()))._pad1 as *const _ as usize },
        141usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs),
            "::",
            stringify!(_pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs>())).ss as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs),
            "::",
            stringify!(ss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs>()))._pad2 as *const _ as usize },
        162usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs),
            "::",
            stringify!(_pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs>())).es as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs),
            "::",
            stringify!(es)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs>()))._pad3 as *const _ as usize },
        170usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs),
            "::",
            stringify!(_pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs>())).ds as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs),
            "::",
            stringify!(ds)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs>()))._pad4 as *const _ as usize },
        178usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs),
            "::",
            stringify!(_pad4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs>())).fs as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs),
            "::",
            stringify!(fs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs>()))._pad5 as *const _ as usize },
        186usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs),
            "::",
            stringify!(_pad5)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs>())).gs as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs),
            "::",
            stringify!(gs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cpu_user_regs>()))._pad6 as *const _ as usize },
        194usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_user_regs),
            "::",
            stringify!(_pad6)
        )
    );
}
pub type cpu_user_regs_t = cpu_user_regs;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_cpu_user_regs_t {
    pub p: *mut cpu_user_regs_t,
}
#[test]
fn bindgen_test_layout___guest_handle_cpu_user_regs_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_cpu_user_regs_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_cpu_user_regs_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_cpu_user_regs_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_cpu_user_regs_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_cpu_user_regs_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_cpu_user_regs_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_cpu_user_regs_t {
    pub p: *const cpu_user_regs_t,
}
#[test]
fn bindgen_test_layout___guest_handle_const_cpu_user_regs_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_cpu_user_regs_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_const_cpu_user_regs_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_cpu_user_regs_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_cpu_user_regs_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_cpu_user_regs_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_cpu_user_regs_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct arch_vcpu_info {
    pub cr2: ::std::os::raw::c_ulong,
    pub pad: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_arch_vcpu_info() {
    assert_eq!(
        ::std::mem::size_of::<arch_vcpu_info>(),
        16usize,
        concat!("Size of: ", stringify!(arch_vcpu_info))
    );
    assert_eq!(
        ::std::mem::align_of::<arch_vcpu_info>(),
        8usize,
        concat!("Alignment of ", stringify!(arch_vcpu_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<arch_vcpu_info>())).cr2 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(arch_vcpu_info),
            "::",
            stringify!(cr2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<arch_vcpu_info>())).pad as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(arch_vcpu_info),
            "::",
            stringify!(pad)
        )
    );
}
pub type arch_vcpu_info_t = arch_vcpu_info;
pub type xen_callback_t = ::std::os::raw::c_ulong;
pub type xen_pfn_t = ::std::os::raw::c_ulong;
pub type xen_ulong_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct trap_info {
    pub vector: u8,
    pub flags: u8,
    pub cs: u16,
    pub address: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_trap_info() {
    assert_eq!(
        ::std::mem::size_of::<trap_info>(),
        16usize,
        concat!("Size of: ", stringify!(trap_info))
    );
    assert_eq!(
        ::std::mem::align_of::<trap_info>(),
        8usize,
        concat!("Alignment of ", stringify!(trap_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<trap_info>())).vector as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(trap_info),
            "::",
            stringify!(vector)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<trap_info>())).flags as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(trap_info),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<trap_info>())).cs as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(trap_info),
            "::",
            stringify!(cs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<trap_info>())).address as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(trap_info),
            "::",
            stringify!(address)
        )
    );
}
pub type trap_info_t = trap_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_trap_info_t {
    pub p: *mut trap_info_t,
}
#[test]
fn bindgen_test_layout___guest_handle_trap_info_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_trap_info_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_trap_info_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_trap_info_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_trap_info_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_trap_info_t>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_trap_info_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_trap_info_t {
    pub p: *const trap_info_t,
}
#[test]
fn bindgen_test_layout___guest_handle_const_trap_info_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_trap_info_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_trap_info_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_trap_info_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_trap_info_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_trap_info_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_trap_info_t),
            "::",
            stringify!(p)
        )
    );
}
pub type tsc_timestamp_t = u64;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct vcpu_guest_context {
    pub fpu_ctxt: vcpu_guest_context__bindgen_ty_1,
    pub flags: ::std::os::raw::c_ulong,
    pub user_regs: cpu_user_regs,
    pub trap_ctxt: [trap_info; 256usize],
    pub ldt_base: ::std::os::raw::c_ulong,
    pub ldt_ents: ::std::os::raw::c_ulong,
    pub gdt_frames: [::std::os::raw::c_ulong; 16usize],
    pub gdt_ents: ::std::os::raw::c_ulong,
    pub kernel_ss: ::std::os::raw::c_ulong,
    pub kernel_sp: ::std::os::raw::c_ulong,
    pub ctrlreg: [::std::os::raw::c_ulong; 8usize],
    pub debugreg: [::std::os::raw::c_ulong; 8usize],
    pub event_callback_eip: ::std::os::raw::c_ulong,
    pub failsafe_callback_eip: ::std::os::raw::c_ulong,
    pub syscall_callback_eip: ::std::os::raw::c_ulong,
    pub vm_assist: ::std::os::raw::c_ulong,
    pub fs_base: u64,
    pub gs_base_kernel: u64,
    pub gs_base_user: u64,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct vcpu_guest_context__bindgen_ty_1 {
    pub x: [::std::os::raw::c_char; 512usize],
}
#[test]
fn bindgen_test_layout_vcpu_guest_context__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_context__bindgen_ty_1>(),
        512usize,
        concat!("Size of: ", stringify!(vcpu_guest_context__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_context__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_context__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_context__bindgen_ty_1>())).x as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context__bindgen_ty_1),
            "::",
            stringify!(x)
        )
    );
}
#[test]
fn bindgen_test_layout_vcpu_guest_context() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_context>(),
        5168usize,
        concat!("Size of: ", stringify!(vcpu_guest_context))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_context>(),
        8usize,
        concat!("Alignment of ", stringify!(vcpu_guest_context))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_context>())).fpu_ctxt as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(fpu_ctxt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_context>())).flags as *const _ as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_context>())).user_regs as *const _ as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(user_regs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_context>())).trap_ctxt as *const _ as usize },
        720usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(trap_ctxt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_context>())).ldt_base as *const _ as usize },
        4816usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(ldt_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_context>())).ldt_ents as *const _ as usize },
        4824usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(ldt_ents)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_context>())).gdt_frames as *const _ as usize },
        4832usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(gdt_frames)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_context>())).gdt_ents as *const _ as usize },
        4960usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(gdt_ents)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_context>())).kernel_ss as *const _ as usize },
        4968usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(kernel_ss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_context>())).kernel_sp as *const _ as usize },
        4976usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(kernel_sp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_context>())).ctrlreg as *const _ as usize },
        4984usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(ctrlreg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_context>())).debugreg as *const _ as usize },
        5048usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(debugreg)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_context>())).event_callback_eip as *const _ as usize
        },
        5112usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(event_callback_eip)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_context>())).failsafe_callback_eip as *const _
                as usize
        },
        5120usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(failsafe_callback_eip)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_context>())).syscall_callback_eip as *const _ as usize
        },
        5128usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(syscall_callback_eip)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_context>())).vm_assist as *const _ as usize },
        5136usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(vm_assist)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_context>())).fs_base as *const _ as usize },
        5144usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(fs_base)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_context>())).gs_base_kernel as *const _ as usize
        },
        5152usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(gs_base_kernel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_context>())).gs_base_user as *const _ as usize },
        5160usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(gs_base_user)
        )
    );
}
pub type vcpu_guest_context_t = vcpu_guest_context;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_vcpu_guest_context_t {
    pub p: *mut vcpu_guest_context_t,
}
#[test]
fn bindgen_test_layout___guest_handle_vcpu_guest_context_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_vcpu_guest_context_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_vcpu_guest_context_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_vcpu_guest_context_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_vcpu_guest_context_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_vcpu_guest_context_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_vcpu_guest_context_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_vcpu_guest_context_t {
    pub p: *const vcpu_guest_context_t,
}
#[test]
fn bindgen_test_layout___guest_handle_const_vcpu_guest_context_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_vcpu_guest_context_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_const_vcpu_guest_context_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_vcpu_guest_context_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_vcpu_guest_context_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_vcpu_guest_context_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_vcpu_guest_context_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct arch_shared_info {
    pub max_pfn: ::std::os::raw::c_ulong,
    pub pfn_to_mfn_frame_list_list: xen_pfn_t,
    pub nmi_reason: ::std::os::raw::c_ulong,
    pub p2m_cr3: ::std::os::raw::c_ulong,
    pub p2m_vaddr: ::std::os::raw::c_ulong,
    pub p2m_generation: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_arch_shared_info() {
    assert_eq!(
        ::std::mem::size_of::<arch_shared_info>(),
        48usize,
        concat!("Size of: ", stringify!(arch_shared_info))
    );
    assert_eq!(
        ::std::mem::align_of::<arch_shared_info>(),
        8usize,
        concat!("Alignment of ", stringify!(arch_shared_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<arch_shared_info>())).max_pfn as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(arch_shared_info),
            "::",
            stringify!(max_pfn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<arch_shared_info>())).pfn_to_mfn_frame_list_list as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(arch_shared_info),
            "::",
            stringify!(pfn_to_mfn_frame_list_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<arch_shared_info>())).nmi_reason as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(arch_shared_info),
            "::",
            stringify!(nmi_reason)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<arch_shared_info>())).p2m_cr3 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(arch_shared_info),
            "::",
            stringify!(p2m_cr3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<arch_shared_info>())).p2m_vaddr as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(arch_shared_info),
            "::",
            stringify!(p2m_vaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<arch_shared_info>())).p2m_generation as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(arch_shared_info),
            "::",
            stringify!(p2m_generation)
        )
    );
}
pub type arch_shared_info_t = arch_shared_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xen_arch_domainconfig {
    pub emulation_flags: u32,
}
#[test]
fn bindgen_test_layout_xen_arch_domainconfig() {
    assert_eq!(
        ::std::mem::size_of::<xen_arch_domainconfig>(),
        4usize,
        concat!("Size of: ", stringify!(xen_arch_domainconfig))
    );
    assert_eq!(
        ::std::mem::align_of::<xen_arch_domainconfig>(),
        4usize,
        concat!("Alignment of ", stringify!(xen_arch_domainconfig))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<xen_arch_domainconfig>())).emulation_flags as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xen_arch_domainconfig),
            "::",
            stringify!(emulation_flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_char {
    pub p: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout___guest_handle_char() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_char>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_char))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_char>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_char))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_char>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_char),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_char {
    pub p: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout___guest_handle_const_char() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_char>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_char))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_char>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_char))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_char>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_char),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_uchar {
    pub p: *mut ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout___guest_handle_uchar() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_uchar>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_uchar))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_uchar>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_uchar))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_uchar>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_uchar),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_uchar {
    pub p: *const ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout___guest_handle_const_uchar() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_uchar>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_uchar))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_uchar>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_uchar))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_uchar>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_uchar),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_int {
    pub p: *mut ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___guest_handle_int() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_int>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_int))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_int>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_int))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_int>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_int),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_int {
    pub p: *const ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___guest_handle_const_int() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_int>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_int))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_int>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_int))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_int>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_int),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_uint {
    pub p: *mut ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___guest_handle_uint() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_uint>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_uint))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_uint>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_uint))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_uint>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_uint),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_uint {
    pub p: *const ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___guest_handle_const_uint() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_uint>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_uint))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_uint>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_uint))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_uint>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_uint),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_void {
    pub p: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout___guest_handle_void() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_void>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_void))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_void>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_void))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_void>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_void),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_void {
    pub p: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout___guest_handle_const_void() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_void>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_void))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_void>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_void))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_void>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_void),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_uint64_t {
    pub p: *mut u64,
}
#[test]
fn bindgen_test_layout___guest_handle_uint64_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_uint64_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_uint64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_uint64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_uint64_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_uint64_t>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_uint64_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_uint64_t {
    pub p: *const u64,
}
#[test]
fn bindgen_test_layout___guest_handle_const_uint64_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_uint64_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_uint64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_uint64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_uint64_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_uint64_t>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_uint64_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_xen_pfn_t {
    pub p: *mut xen_pfn_t,
}
#[test]
fn bindgen_test_layout___guest_handle_xen_pfn_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_xen_pfn_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_xen_pfn_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_xen_pfn_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_xen_pfn_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_xen_pfn_t>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_xen_pfn_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_xen_pfn_t {
    pub p: *const xen_pfn_t,
}
#[test]
fn bindgen_test_layout___guest_handle_const_xen_pfn_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_xen_pfn_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_xen_pfn_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_xen_pfn_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_xen_pfn_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_xen_pfn_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_xen_pfn_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_xen_ulong_t {
    pub p: *mut xen_ulong_t,
}
#[test]
fn bindgen_test_layout___guest_handle_xen_ulong_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_xen_ulong_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_xen_ulong_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_xen_ulong_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_xen_ulong_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_xen_ulong_t>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_xen_ulong_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_xen_ulong_t {
    pub p: *const xen_ulong_t,
}
#[test]
fn bindgen_test_layout___guest_handle_const_xen_ulong_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_xen_ulong_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_xen_ulong_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_xen_ulong_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_xen_ulong_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_xen_ulong_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_xen_ulong_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct mmuext_op {
    pub cmd: ::std::os::raw::c_uint,
    pub arg1: mmuext_op__bindgen_ty_1,
    pub arg2: mmuext_op__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union mmuext_op__bindgen_ty_1 {
    pub mfn: xen_pfn_t,
    pub linear_addr: ::std::os::raw::c_ulong,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_mmuext_op__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<mmuext_op__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(mmuext_op__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<mmuext_op__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(mmuext_op__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mmuext_op__bindgen_ty_1>())).mfn as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mmuext_op__bindgen_ty_1),
            "::",
            stringify!(mfn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<mmuext_op__bindgen_ty_1>())).linear_addr as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mmuext_op__bindgen_ty_1),
            "::",
            stringify!(linear_addr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union mmuext_op__bindgen_ty_2 {
    pub nr_ents: ::std::os::raw::c_uint,
    pub vcpumask: __guest_handle_const_void,
    pub src_mfn: xen_pfn_t,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_mmuext_op__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<mmuext_op__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(mmuext_op__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<mmuext_op__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(mmuext_op__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mmuext_op__bindgen_ty_2>())).nr_ents as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mmuext_op__bindgen_ty_2),
            "::",
            stringify!(nr_ents)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<mmuext_op__bindgen_ty_2>())).vcpumask as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mmuext_op__bindgen_ty_2),
            "::",
            stringify!(vcpumask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mmuext_op__bindgen_ty_2>())).src_mfn as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mmuext_op__bindgen_ty_2),
            "::",
            stringify!(src_mfn)
        )
    );
}
#[test]
fn bindgen_test_layout_mmuext_op() {
    assert_eq!(
        ::std::mem::size_of::<mmuext_op>(),
        24usize,
        concat!("Size of: ", stringify!(mmuext_op))
    );
    assert_eq!(
        ::std::mem::align_of::<mmuext_op>(),
        8usize,
        concat!("Alignment of ", stringify!(mmuext_op))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mmuext_op>())).cmd as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mmuext_op),
            "::",
            stringify!(cmd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mmuext_op>())).arg1 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mmuext_op),
            "::",
            stringify!(arg1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mmuext_op>())).arg2 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mmuext_op),
            "::",
            stringify!(arg2)
        )
    );
}
pub type mmuext_op_t = mmuext_op;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_mmuext_op_t {
    pub p: *mut mmuext_op_t,
}
#[test]
fn bindgen_test_layout___guest_handle_mmuext_op_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_mmuext_op_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_mmuext_op_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_mmuext_op_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_mmuext_op_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_mmuext_op_t>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_mmuext_op_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_mmuext_op_t {
    pub p: *const mmuext_op_t,
}
#[test]
fn bindgen_test_layout___guest_handle_const_mmuext_op_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_mmuext_op_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_mmuext_op_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_mmuext_op_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_mmuext_op_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_mmuext_op_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_mmuext_op_t),
            "::",
            stringify!(p)
        )
    );
}
pub type domid_t = u16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mmu_update {
    pub ptr: u64,
    pub val: u64,
}
#[test]
fn bindgen_test_layout_mmu_update() {
    assert_eq!(
        ::std::mem::size_of::<mmu_update>(),
        16usize,
        concat!("Size of: ", stringify!(mmu_update))
    );
    assert_eq!(
        ::std::mem::align_of::<mmu_update>(),
        8usize,
        concat!("Alignment of ", stringify!(mmu_update))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mmu_update>())).ptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mmu_update),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mmu_update>())).val as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mmu_update),
            "::",
            stringify!(val)
        )
    );
}
pub type mmu_update_t = mmu_update;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_mmu_update_t {
    pub p: *mut mmu_update_t,
}
#[test]
fn bindgen_test_layout___guest_handle_mmu_update_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_mmu_update_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_mmu_update_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_mmu_update_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_mmu_update_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_mmu_update_t>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_mmu_update_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_mmu_update_t {
    pub p: *const mmu_update_t,
}
#[test]
fn bindgen_test_layout___guest_handle_const_mmu_update_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_mmu_update_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_mmu_update_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_mmu_update_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_mmu_update_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_mmu_update_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_mmu_update_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct multicall_entry {
    pub op: xen_ulong_t,
    pub result: xen_ulong_t,
    pub args: [xen_ulong_t; 6usize],
}
#[test]
fn bindgen_test_layout_multicall_entry() {
    assert_eq!(
        ::std::mem::size_of::<multicall_entry>(),
        64usize,
        concat!("Size of: ", stringify!(multicall_entry))
    );
    assert_eq!(
        ::std::mem::align_of::<multicall_entry>(),
        8usize,
        concat!("Alignment of ", stringify!(multicall_entry))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<multicall_entry>())).op as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(multicall_entry),
            "::",
            stringify!(op)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<multicall_entry>())).result as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(multicall_entry),
            "::",
            stringify!(result)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<multicall_entry>())).args as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(multicall_entry),
            "::",
            stringify!(args)
        )
    );
}
pub type multicall_entry_t = multicall_entry;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_multicall_entry_t {
    pub p: *mut multicall_entry_t,
}
#[test]
fn bindgen_test_layout___guest_handle_multicall_entry_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_multicall_entry_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_multicall_entry_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_multicall_entry_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_multicall_entry_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_multicall_entry_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_multicall_entry_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_multicall_entry_t {
    pub p: *const multicall_entry_t,
}
#[test]
fn bindgen_test_layout___guest_handle_const_multicall_entry_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_multicall_entry_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_const_multicall_entry_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_multicall_entry_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_multicall_entry_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_multicall_entry_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_multicall_entry_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vcpu_time_info {
    pub version: u32,
    pub pad0: u32,
    pub tsc_timestamp: u64,
    pub system_time: u64,
    pub tsc_to_system_mul: u32,
    pub tsc_shift: i8,
    pub flags: u8,
    pub pad1: [u8; 2usize],
}
#[test]
fn bindgen_test_layout_vcpu_time_info() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_time_info>(),
        32usize,
        concat!("Size of: ", stringify!(vcpu_time_info))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_time_info>(),
        8usize,
        concat!("Alignment of ", stringify!(vcpu_time_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_time_info>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_time_info),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_time_info>())).pad0 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_time_info),
            "::",
            stringify!(pad0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_time_info>())).tsc_timestamp as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_time_info),
            "::",
            stringify!(tsc_timestamp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_time_info>())).system_time as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_time_info),
            "::",
            stringify!(system_time)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_time_info>())).tsc_to_system_mul as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_time_info),
            "::",
            stringify!(tsc_to_system_mul)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_time_info>())).tsc_shift as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_time_info),
            "::",
            stringify!(tsc_shift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_time_info>())).flags as *const _ as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_time_info),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_time_info>())).pad1 as *const _ as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_time_info),
            "::",
            stringify!(pad1)
        )
    );
}
pub type vcpu_time_info_t = vcpu_time_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vcpu_info {
    pub evtchn_upcall_pending: u8,
    pub evtchn_upcall_mask: u8,
    pub evtchn_pending_sel: xen_ulong_t,
    pub arch: arch_vcpu_info,
    pub time: vcpu_time_info,
}
#[test]
fn bindgen_test_layout_vcpu_info() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_info>(),
        64usize,
        concat!("Size of: ", stringify!(vcpu_info))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_info>(),
        8usize,
        concat!("Alignment of ", stringify!(vcpu_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_info>())).evtchn_upcall_pending as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_info),
            "::",
            stringify!(evtchn_upcall_pending)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_info>())).evtchn_upcall_mask as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_info),
            "::",
            stringify!(evtchn_upcall_mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_info>())).evtchn_pending_sel as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_info),
            "::",
            stringify!(evtchn_pending_sel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_info>())).arch as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_info),
            "::",
            stringify!(arch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_info>())).time as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_info),
            "::",
            stringify!(time)
        )
    );
}
pub type vcpu_info_t = vcpu_info;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct shared_info {
    pub vcpu_info: [vcpu_info; 32usize],
    pub evtchn_pending: [xen_ulong_t; 64usize],
    pub evtchn_mask: [xen_ulong_t; 64usize],
    pub wc_version: u32,
    pub wc_sec: u32,
    pub wc_nsec: u32,
    pub wc_sec_hi: u32,
    pub arch: arch_shared_info,
}
#[test]
fn bindgen_test_layout_shared_info() {
    assert_eq!(
        ::std::mem::size_of::<shared_info>(),
        3136usize,
        concat!("Size of: ", stringify!(shared_info))
    );
    assert_eq!(
        ::std::mem::align_of::<shared_info>(),
        8usize,
        concat!("Alignment of ", stringify!(shared_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<shared_info>())).vcpu_info as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(shared_info),
            "::",
            stringify!(vcpu_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<shared_info>())).evtchn_pending as *const _ as usize },
        2048usize,
        concat!(
            "Offset of field: ",
            stringify!(shared_info),
            "::",
            stringify!(evtchn_pending)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<shared_info>())).evtchn_mask as *const _ as usize },
        2560usize,
        concat!(
            "Offset of field: ",
            stringify!(shared_info),
            "::",
            stringify!(evtchn_mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<shared_info>())).wc_version as *const _ as usize },
        3072usize,
        concat!(
            "Offset of field: ",
            stringify!(shared_info),
            "::",
            stringify!(wc_version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<shared_info>())).wc_sec as *const _ as usize },
        3076usize,
        concat!(
            "Offset of field: ",
            stringify!(shared_info),
            "::",
            stringify!(wc_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<shared_info>())).wc_nsec as *const _ as usize },
        3080usize,
        concat!(
            "Offset of field: ",
            stringify!(shared_info),
            "::",
            stringify!(wc_nsec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<shared_info>())).wc_sec_hi as *const _ as usize },
        3084usize,
        concat!(
            "Offset of field: ",
            stringify!(shared_info),
            "::",
            stringify!(wc_sec_hi)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<shared_info>())).arch as *const _ as usize },
        3088usize,
        concat!(
            "Offset of field: ",
            stringify!(shared_info),
            "::",
            stringify!(arch)
        )
    );
}
pub type shared_info_t = shared_info;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct start_info {
    pub magic: [::std::os::raw::c_char; 32usize],
    pub nr_pages: ::std::os::raw::c_ulong,
    pub shared_info: ::std::os::raw::c_ulong,
    pub flags: u32,
    pub store_mfn: xen_pfn_t,
    pub store_evtchn: u32,
    pub console: start_info__bindgen_ty_1,
    pub pt_base: ::std::os::raw::c_ulong,
    pub nr_pt_frames: ::std::os::raw::c_ulong,
    pub mfn_list: ::std::os::raw::c_ulong,
    pub mod_start: ::std::os::raw::c_ulong,
    pub mod_len: ::std::os::raw::c_ulong,
    pub cmd_line: [i8; 1024usize],
    pub first_p2m_pfn: ::std::os::raw::c_ulong,
    pub nr_p2m_frames: ::std::os::raw::c_ulong,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union start_info__bindgen_ty_1 {
    pub domU: start_info__bindgen_ty_1__bindgen_ty_1,
    pub dom0: start_info__bindgen_ty_1__bindgen_ty_2,
    _bindgen_union_align: [u64; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct start_info__bindgen_ty_1__bindgen_ty_1 {
    pub mfn: xen_pfn_t,
    pub evtchn: u32,
}
#[test]
fn bindgen_test_layout_start_info__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<start_info__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(start_info__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<start_info__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(start_info__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<start_info__bindgen_ty_1__bindgen_ty_1>())).mfn as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(start_info__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(mfn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<start_info__bindgen_ty_1__bindgen_ty_1>())).evtchn as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(start_info__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(evtchn)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct start_info__bindgen_ty_1__bindgen_ty_2 {
    pub info_off: u32,
    pub info_size: u32,
}
#[test]
fn bindgen_test_layout_start_info__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<start_info__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(start_info__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<start_info__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(start_info__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<start_info__bindgen_ty_1__bindgen_ty_2>())).info_off as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(start_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(info_off)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<start_info__bindgen_ty_1__bindgen_ty_2>())).info_size as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(start_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(info_size)
        )
    );
}
#[test]
fn bindgen_test_layout_start_info__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<start_info__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(start_info__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<start_info__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(start_info__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<start_info__bindgen_ty_1>())).domU as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(start_info__bindgen_ty_1),
            "::",
            stringify!(domU)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<start_info__bindgen_ty_1>())).dom0 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(start_info__bindgen_ty_1),
            "::",
            stringify!(dom0)
        )
    );
}
#[test]
fn bindgen_test_layout_start_info() {
    assert_eq!(
        ::std::mem::size_of::<start_info>(),
        1168usize,
        concat!("Size of: ", stringify!(start_info))
    );
    assert_eq!(
        ::std::mem::align_of::<start_info>(),
        8usize,
        concat!("Alignment of ", stringify!(start_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<start_info>())).magic as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(start_info),
            "::",
            stringify!(magic)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<start_info>())).nr_pages as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(start_info),
            "::",
            stringify!(nr_pages)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<start_info>())).shared_info as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(start_info),
            "::",
            stringify!(shared_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<start_info>())).flags as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(start_info),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<start_info>())).store_mfn as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(start_info),
            "::",
            stringify!(store_mfn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<start_info>())).store_evtchn as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(start_info),
            "::",
            stringify!(store_evtchn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<start_info>())).console as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(start_info),
            "::",
            stringify!(console)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<start_info>())).pt_base as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(start_info),
            "::",
            stringify!(pt_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<start_info>())).nr_pt_frames as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(start_info),
            "::",
            stringify!(nr_pt_frames)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<start_info>())).mfn_list as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(start_info),
            "::",
            stringify!(mfn_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<start_info>())).mod_start as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(start_info),
            "::",
            stringify!(mod_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<start_info>())).mod_len as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(start_info),
            "::",
            stringify!(mod_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<start_info>())).cmd_line as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(start_info),
            "::",
            stringify!(cmd_line)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<start_info>())).first_p2m_pfn as *const _ as usize },
        1152usize,
        concat!(
            "Offset of field: ",
            stringify!(start_info),
            "::",
            stringify!(first_p2m_pfn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<start_info>())).nr_p2m_frames as *const _ as usize },
        1160usize,
        concat!(
            "Offset of field: ",
            stringify!(start_info),
            "::",
            stringify!(nr_p2m_frames)
        )
    );
}
pub type start_info_t = start_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xen_multiboot_mod_list {
    pub mod_start: u32,
    pub mod_end: u32,
    pub cmdline: u32,
    pub pad: u32,
}
#[test]
fn bindgen_test_layout_xen_multiboot_mod_list() {
    assert_eq!(
        ::std::mem::size_of::<xen_multiboot_mod_list>(),
        16usize,
        concat!("Size of: ", stringify!(xen_multiboot_mod_list))
    );
    assert_eq!(
        ::std::mem::align_of::<xen_multiboot_mod_list>(),
        4usize,
        concat!("Alignment of ", stringify!(xen_multiboot_mod_list))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<xen_multiboot_mod_list>())).mod_start as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xen_multiboot_mod_list),
            "::",
            stringify!(mod_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xen_multiboot_mod_list>())).mod_end as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xen_multiboot_mod_list),
            "::",
            stringify!(mod_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xen_multiboot_mod_list>())).cmdline as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xen_multiboot_mod_list),
            "::",
            stringify!(cmdline)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xen_multiboot_mod_list>())).pad as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(xen_multiboot_mod_list),
            "::",
            stringify!(pad)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dom0_vga_console_info {
    pub video_type: u8,
    pub u: dom0_vga_console_info__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union dom0_vga_console_info__bindgen_ty_1 {
    pub text_mode_3: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1,
    pub vesa_lfb: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
    _bindgen_union_align: [u32; 8usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1 {
    pub font_height: u16,
    pub cursor_x: u16,
    pub cursor_y: u16,
    pub rows: u16,
    pub columns: u16,
}
#[test]
fn bindgen_test_layout_dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1>(),
        10usize,
        concat!(
            "Size of: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1>()))
                .font_height as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(font_height)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1>())).cursor_x
                as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(cursor_x)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1>())).cursor_y
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(cursor_y)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1>())).rows
                as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(rows)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1>())).columns
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(columns)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2 {
    pub width: u16,
    pub height: u16,
    pub bytes_per_line: u16,
    pub bits_per_pixel: u16,
    pub lfb_base: u32,
    pub lfb_size: u32,
    pub red_pos: u8,
    pub red_size: u8,
    pub green_pos: u8,
    pub green_size: u8,
    pub blue_pos: u8,
    pub blue_size: u8,
    pub rsvd_pos: u8,
    pub rsvd_size: u8,
    pub gbl_caps: u32,
    pub mode_attrs: u16,
}
#[test]
fn bindgen_test_layout_dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).width
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).height
                as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>()))
                .bytes_per_line as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(bytes_per_line)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>()))
                .bits_per_pixel as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(bits_per_pixel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).lfb_base
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(lfb_base)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).lfb_size
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(lfb_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).red_pos
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(red_pos)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).red_size
                as *const _ as usize
        },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(red_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).green_pos
                as *const _ as usize
        },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(green_pos)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).green_size
                as *const _ as usize
        },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(green_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).blue_pos
                as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(blue_pos)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).blue_size
                as *const _ as usize
        },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(blue_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).rsvd_pos
                as *const _ as usize
        },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(rsvd_pos)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).rsvd_size
                as *const _ as usize
        },
        23usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(rsvd_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).gbl_caps
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(gbl_caps)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).mode_attrs
                as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(mode_attrs)
        )
    );
}
#[test]
fn bindgen_test_layout_dom0_vga_console_info__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<dom0_vga_console_info__bindgen_ty_1>(),
        32usize,
        concat!("Size of: ", stringify!(dom0_vga_console_info__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<dom0_vga_console_info__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(dom0_vga_console_info__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1>())).text_mode_3 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1),
            "::",
            stringify!(text_mode_3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1>())).vesa_lfb as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1),
            "::",
            stringify!(vesa_lfb)
        )
    );
}
#[test]
fn bindgen_test_layout_dom0_vga_console_info() {
    assert_eq!(
        ::std::mem::size_of::<dom0_vga_console_info>(),
        36usize,
        concat!("Size of: ", stringify!(dom0_vga_console_info))
    );
    assert_eq!(
        ::std::mem::align_of::<dom0_vga_console_info>(),
        4usize,
        concat!("Alignment of ", stringify!(dom0_vga_console_info))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info>())).video_type as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info),
            "::",
            stringify!(video_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dom0_vga_console_info>())).u as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info),
            "::",
            stringify!(u)
        )
    );
}
pub type dom0_vga_console_info_t = dom0_vga_console_info;
pub type xen_domain_handle_t = [u8; 16usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_uint8 {
    pub p: *mut u8,
}
#[test]
fn bindgen_test_layout___guest_handle_uint8() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_uint8>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_uint8))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_uint8>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_uint8))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_uint8>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_uint8),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_uint8 {
    pub p: *const u8,
}
#[test]
fn bindgen_test_layout___guest_handle_const_uint8() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_uint8>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_uint8))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_uint8>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_uint8))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_uint8>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_uint8),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_uint16 {
    pub p: *mut u16,
}
#[test]
fn bindgen_test_layout___guest_handle_uint16() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_uint16>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_uint16))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_uint16>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_uint16))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_uint16>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_uint16),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_uint16 {
    pub p: *const u16,
}
#[test]
fn bindgen_test_layout___guest_handle_const_uint16() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_uint16>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_uint16))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_uint16>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_uint16))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_uint16>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_uint16),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_uint32 {
    pub p: *mut u32,
}
#[test]
fn bindgen_test_layout___guest_handle_uint32() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_uint32>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_uint32))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_uint32>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_uint32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_uint32>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_uint32),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_uint32 {
    pub p: *const u32,
}
#[test]
fn bindgen_test_layout___guest_handle_const_uint32() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_uint32>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_uint32))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_uint32>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_uint32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_uint32>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_uint32),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_uint64 {
    pub p: *mut u64,
}
#[test]
fn bindgen_test_layout___guest_handle_uint64() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_uint64>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_uint64))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_uint64>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_uint64))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_uint64>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_uint64),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_uint64 {
    pub p: *const u64,
}
#[test]
fn bindgen_test_layout___guest_handle_const_uint64() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_uint64>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_uint64))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_uint64>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_uint64))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_uint64>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_uint64),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xenctl_bitmap {
    pub bitmap: __guest_handle_uint8,
    pub nr_bits: u32,
}
#[test]
fn bindgen_test_layout_xenctl_bitmap() {
    assert_eq!(
        ::std::mem::size_of::<xenctl_bitmap>(),
        16usize,
        concat!("Size of: ", stringify!(xenctl_bitmap))
    );
    assert_eq!(
        ::std::mem::align_of::<xenctl_bitmap>(),
        8usize,
        concat!("Alignment of ", stringify!(xenctl_bitmap))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xenctl_bitmap>())).bitmap as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xenctl_bitmap),
            "::",
            stringify!(bitmap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xenctl_bitmap>())).nr_bits as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xenctl_bitmap),
            "::",
            stringify!(nr_bits)
        )
    );
}
pub type grant_ref_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct grant_entry_v1 {
    pub flags: u16,
    pub domid: domid_t,
    pub frame: u32,
}
#[test]
fn bindgen_test_layout_grant_entry_v1() {
    assert_eq!(
        ::std::mem::size_of::<grant_entry_v1>(),
        8usize,
        concat!("Size of: ", stringify!(grant_entry_v1))
    );
    assert_eq!(
        ::std::mem::align_of::<grant_entry_v1>(),
        4usize,
        concat!("Alignment of ", stringify!(grant_entry_v1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grant_entry_v1>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v1),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grant_entry_v1>())).domid as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v1),
            "::",
            stringify!(domid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grant_entry_v1>())).frame as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v1),
            "::",
            stringify!(frame)
        )
    );
}
pub type grant_entry_v1_t = grant_entry_v1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct grant_entry_header {
    pub flags: u16,
    pub domid: domid_t,
}
#[test]
fn bindgen_test_layout_grant_entry_header() {
    assert_eq!(
        ::std::mem::size_of::<grant_entry_header>(),
        4usize,
        concat!("Size of: ", stringify!(grant_entry_header))
    );
    assert_eq!(
        ::std::mem::align_of::<grant_entry_header>(),
        2usize,
        concat!("Alignment of ", stringify!(grant_entry_header))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grant_entry_header>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_header),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grant_entry_header>())).domid as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_header),
            "::",
            stringify!(domid)
        )
    );
}
pub type grant_entry_header_t = grant_entry_header;
#[repr(C)]
#[derive(Copy, Clone)]
pub union grant_entry_v2 {
    pub hdr: grant_entry_header_t,
    pub full_page: grant_entry_v2__bindgen_ty_1,
    pub sub_page: grant_entry_v2__bindgen_ty_2,
    pub transitive: grant_entry_v2__bindgen_ty_3,
    pub __spacer: [u32; 4usize],
    _bindgen_union_align: [u64; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct grant_entry_v2__bindgen_ty_1 {
    pub hdr: grant_entry_header_t,
    pub pad0: u32,
    pub frame: u64,
}
#[test]
fn bindgen_test_layout_grant_entry_v2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<grant_entry_v2__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(grant_entry_v2__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<grant_entry_v2__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(grant_entry_v2__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<grant_entry_v2__bindgen_ty_1>())).hdr as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2__bindgen_ty_1),
            "::",
            stringify!(hdr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<grant_entry_v2__bindgen_ty_1>())).pad0 as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2__bindgen_ty_1),
            "::",
            stringify!(pad0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<grant_entry_v2__bindgen_ty_1>())).frame as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2__bindgen_ty_1),
            "::",
            stringify!(frame)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct grant_entry_v2__bindgen_ty_2 {
    pub hdr: grant_entry_header_t,
    pub page_off: u16,
    pub length: u16,
    pub frame: u64,
}
#[test]
fn bindgen_test_layout_grant_entry_v2__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<grant_entry_v2__bindgen_ty_2>(),
        16usize,
        concat!("Size of: ", stringify!(grant_entry_v2__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<grant_entry_v2__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(grant_entry_v2__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<grant_entry_v2__bindgen_ty_2>())).hdr as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2__bindgen_ty_2),
            "::",
            stringify!(hdr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<grant_entry_v2__bindgen_ty_2>())).page_off as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2__bindgen_ty_2),
            "::",
            stringify!(page_off)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<grant_entry_v2__bindgen_ty_2>())).length as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2__bindgen_ty_2),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<grant_entry_v2__bindgen_ty_2>())).frame as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2__bindgen_ty_2),
            "::",
            stringify!(frame)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct grant_entry_v2__bindgen_ty_3 {
    pub hdr: grant_entry_header_t,
    pub trans_domid: domid_t,
    pub pad0: u16,
    pub gref: grant_ref_t,
}
#[test]
fn bindgen_test_layout_grant_entry_v2__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<grant_entry_v2__bindgen_ty_3>(),
        12usize,
        concat!("Size of: ", stringify!(grant_entry_v2__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<grant_entry_v2__bindgen_ty_3>(),
        4usize,
        concat!("Alignment of ", stringify!(grant_entry_v2__bindgen_ty_3))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<grant_entry_v2__bindgen_ty_3>())).hdr as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2__bindgen_ty_3),
            "::",
            stringify!(hdr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<grant_entry_v2__bindgen_ty_3>())).trans_domid as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2__bindgen_ty_3),
            "::",
            stringify!(trans_domid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<grant_entry_v2__bindgen_ty_3>())).pad0 as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2__bindgen_ty_3),
            "::",
            stringify!(pad0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<grant_entry_v2__bindgen_ty_3>())).gref as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2__bindgen_ty_3),
            "::",
            stringify!(gref)
        )
    );
}
#[test]
fn bindgen_test_layout_grant_entry_v2() {
    assert_eq!(
        ::std::mem::size_of::<grant_entry_v2>(),
        16usize,
        concat!("Size of: ", stringify!(grant_entry_v2))
    );
    assert_eq!(
        ::std::mem::align_of::<grant_entry_v2>(),
        8usize,
        concat!("Alignment of ", stringify!(grant_entry_v2))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grant_entry_v2>())).hdr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2),
            "::",
            stringify!(hdr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grant_entry_v2>())).full_page as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2),
            "::",
            stringify!(full_page)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grant_entry_v2>())).sub_page as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2),
            "::",
            stringify!(sub_page)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grant_entry_v2>())).transitive as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2),
            "::",
            stringify!(transitive)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grant_entry_v2>())).__spacer as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2),
            "::",
            stringify!(__spacer)
        )
    );
}
pub type grant_entry_v2_t = grant_entry_v2;
pub type grant_status_t = u16;
pub type grant_handle_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gnttab_map_grant_ref {
    pub host_addr: u64,
    pub flags: u32,
    pub ref_: grant_ref_t,
    pub dom: domid_t,
    pub status: i16,
    pub handle: grant_handle_t,
    pub dev_bus_addr: u64,
}
#[test]
fn bindgen_test_layout_gnttab_map_grant_ref() {
    assert_eq!(
        ::std::mem::size_of::<gnttab_map_grant_ref>(),
        32usize,
        concat!("Size of: ", stringify!(gnttab_map_grant_ref))
    );
    assert_eq!(
        ::std::mem::align_of::<gnttab_map_grant_ref>(),
        8usize,
        concat!("Alignment of ", stringify!(gnttab_map_grant_ref))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_map_grant_ref>())).host_addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_map_grant_ref),
            "::",
            stringify!(host_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_map_grant_ref>())).flags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_map_grant_ref),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_map_grant_ref>())).ref_ as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_map_grant_ref),
            "::",
            stringify!(ref_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_map_grant_ref>())).dom as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_map_grant_ref),
            "::",
            stringify!(dom)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_map_grant_ref>())).status as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_map_grant_ref),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_map_grant_ref>())).handle as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_map_grant_ref),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<gnttab_map_grant_ref>())).dev_bus_addr as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_map_grant_ref),
            "::",
            stringify!(dev_bus_addr)
        )
    );
}
pub type gnttab_map_grant_ref_t = gnttab_map_grant_ref;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_map_grant_ref_t {
    pub p: *mut gnttab_map_grant_ref_t,
}
#[test]
fn bindgen_test_layout___guest_handle_gnttab_map_grant_ref_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_gnttab_map_grant_ref_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_gnttab_map_grant_ref_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_gnttab_map_grant_ref_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_gnttab_map_grant_ref_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_gnttab_map_grant_ref_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_gnttab_map_grant_ref_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_map_grant_ref_t {
    pub p: *const gnttab_map_grant_ref_t,
}
#[test]
fn bindgen_test_layout___guest_handle_const_gnttab_map_grant_ref_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_gnttab_map_grant_ref_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_const_gnttab_map_grant_ref_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_gnttab_map_grant_ref_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_gnttab_map_grant_ref_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_gnttab_map_grant_ref_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_gnttab_map_grant_ref_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gnttab_unmap_grant_ref {
    pub host_addr: u64,
    pub dev_bus_addr: u64,
    pub handle: grant_handle_t,
    pub status: i16,
}
#[test]
fn bindgen_test_layout_gnttab_unmap_grant_ref() {
    assert_eq!(
        ::std::mem::size_of::<gnttab_unmap_grant_ref>(),
        24usize,
        concat!("Size of: ", stringify!(gnttab_unmap_grant_ref))
    );
    assert_eq!(
        ::std::mem::align_of::<gnttab_unmap_grant_ref>(),
        8usize,
        concat!("Alignment of ", stringify!(gnttab_unmap_grant_ref))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<gnttab_unmap_grant_ref>())).host_addr as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_unmap_grant_ref),
            "::",
            stringify!(host_addr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<gnttab_unmap_grant_ref>())).dev_bus_addr as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_unmap_grant_ref),
            "::",
            stringify!(dev_bus_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_unmap_grant_ref>())).handle as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_unmap_grant_ref),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_unmap_grant_ref>())).status as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_unmap_grant_ref),
            "::",
            stringify!(status)
        )
    );
}
pub type gnttab_unmap_grant_ref_t = gnttab_unmap_grant_ref;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_unmap_grant_ref_t {
    pub p: *mut gnttab_unmap_grant_ref_t,
}
#[test]
fn bindgen_test_layout___guest_handle_gnttab_unmap_grant_ref_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_gnttab_unmap_grant_ref_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_gnttab_unmap_grant_ref_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_gnttab_unmap_grant_ref_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_gnttab_unmap_grant_ref_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_gnttab_unmap_grant_ref_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_gnttab_unmap_grant_ref_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_unmap_grant_ref_t {
    pub p: *const gnttab_unmap_grant_ref_t,
}
#[test]
fn bindgen_test_layout___guest_handle_const_gnttab_unmap_grant_ref_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_gnttab_unmap_grant_ref_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_const_gnttab_unmap_grant_ref_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_gnttab_unmap_grant_ref_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_gnttab_unmap_grant_ref_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_gnttab_unmap_grant_ref_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_gnttab_unmap_grant_ref_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gnttab_setup_table {
    pub dom: domid_t,
    pub nr_frames: u32,
    pub status: i16,
    pub frame_list: __guest_handle_xen_pfn_t,
}
#[test]
fn bindgen_test_layout_gnttab_setup_table() {
    assert_eq!(
        ::std::mem::size_of::<gnttab_setup_table>(),
        24usize,
        concat!("Size of: ", stringify!(gnttab_setup_table))
    );
    assert_eq!(
        ::std::mem::align_of::<gnttab_setup_table>(),
        8usize,
        concat!("Alignment of ", stringify!(gnttab_setup_table))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_setup_table>())).dom as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_setup_table),
            "::",
            stringify!(dom)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_setup_table>())).nr_frames as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_setup_table),
            "::",
            stringify!(nr_frames)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_setup_table>())).status as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_setup_table),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_setup_table>())).frame_list as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_setup_table),
            "::",
            stringify!(frame_list)
        )
    );
}
pub type gnttab_setup_table_t = gnttab_setup_table;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_setup_table_t {
    pub p: *mut gnttab_setup_table_t,
}
#[test]
fn bindgen_test_layout___guest_handle_gnttab_setup_table_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_gnttab_setup_table_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_gnttab_setup_table_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_gnttab_setup_table_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_gnttab_setup_table_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_gnttab_setup_table_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_gnttab_setup_table_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_setup_table_t {
    pub p: *const gnttab_setup_table_t,
}
#[test]
fn bindgen_test_layout___guest_handle_const_gnttab_setup_table_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_gnttab_setup_table_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_const_gnttab_setup_table_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_gnttab_setup_table_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_gnttab_setup_table_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_gnttab_setup_table_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_gnttab_setup_table_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gnttab_dump_table {
    pub dom: domid_t,
    pub status: i16,
}
#[test]
fn bindgen_test_layout_gnttab_dump_table() {
    assert_eq!(
        ::std::mem::size_of::<gnttab_dump_table>(),
        4usize,
        concat!("Size of: ", stringify!(gnttab_dump_table))
    );
    assert_eq!(
        ::std::mem::align_of::<gnttab_dump_table>(),
        2usize,
        concat!("Alignment of ", stringify!(gnttab_dump_table))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_dump_table>())).dom as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_dump_table),
            "::",
            stringify!(dom)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_dump_table>())).status as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_dump_table),
            "::",
            stringify!(status)
        )
    );
}
pub type gnttab_dump_table_t = gnttab_dump_table;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_dump_table_t {
    pub p: *mut gnttab_dump_table_t,
}
#[test]
fn bindgen_test_layout___guest_handle_gnttab_dump_table_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_gnttab_dump_table_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_gnttab_dump_table_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_gnttab_dump_table_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_gnttab_dump_table_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_gnttab_dump_table_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_gnttab_dump_table_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_dump_table_t {
    pub p: *const gnttab_dump_table_t,
}
#[test]
fn bindgen_test_layout___guest_handle_const_gnttab_dump_table_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_gnttab_dump_table_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_const_gnttab_dump_table_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_gnttab_dump_table_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_gnttab_dump_table_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_gnttab_dump_table_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_gnttab_dump_table_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gnttab_transfer {
    pub mfn: xen_pfn_t,
    pub domid: domid_t,
    pub ref_: grant_ref_t,
    pub status: i16,
}
#[test]
fn bindgen_test_layout_gnttab_transfer() {
    assert_eq!(
        ::std::mem::size_of::<gnttab_transfer>(),
        24usize,
        concat!("Size of: ", stringify!(gnttab_transfer))
    );
    assert_eq!(
        ::std::mem::align_of::<gnttab_transfer>(),
        8usize,
        concat!("Alignment of ", stringify!(gnttab_transfer))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_transfer>())).mfn as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_transfer),
            "::",
            stringify!(mfn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_transfer>())).domid as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_transfer),
            "::",
            stringify!(domid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_transfer>())).ref_ as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_transfer),
            "::",
            stringify!(ref_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_transfer>())).status as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_transfer),
            "::",
            stringify!(status)
        )
    );
}
pub type gnttab_transfer_t = gnttab_transfer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_transfer_t {
    pub p: *mut gnttab_transfer_t,
}
#[test]
fn bindgen_test_layout___guest_handle_gnttab_transfer_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_gnttab_transfer_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_gnttab_transfer_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_gnttab_transfer_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_gnttab_transfer_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_gnttab_transfer_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_gnttab_transfer_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_transfer_t {
    pub p: *const gnttab_transfer_t,
}
#[test]
fn bindgen_test_layout___guest_handle_const_gnttab_transfer_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_gnttab_transfer_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_const_gnttab_transfer_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_gnttab_transfer_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_gnttab_transfer_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_gnttab_transfer_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_gnttab_transfer_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct gnttab_copy {
    pub source: gnttab_copy_gnttab_copy_ptr,
    pub dest: gnttab_copy_gnttab_copy_ptr,
    pub len: u16,
    pub flags: u16,
    pub status: i16,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct gnttab_copy_gnttab_copy_ptr {
    pub u: gnttab_copy_gnttab_copy_ptr__bindgen_ty_1,
    pub domid: domid_t,
    pub offset: u16,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union gnttab_copy_gnttab_copy_ptr__bindgen_ty_1 {
    pub ref_: grant_ref_t,
    pub gmfn: xen_pfn_t,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_gnttab_copy_gnttab_copy_ptr__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<gnttab_copy_gnttab_copy_ptr__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(gnttab_copy_gnttab_copy_ptr__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<gnttab_copy_gnttab_copy_ptr__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(gnttab_copy_gnttab_copy_ptr__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<gnttab_copy_gnttab_copy_ptr__bindgen_ty_1>())).ref_ as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_copy_gnttab_copy_ptr__bindgen_ty_1),
            "::",
            stringify!(ref_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<gnttab_copy_gnttab_copy_ptr__bindgen_ty_1>())).gmfn as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_copy_gnttab_copy_ptr__bindgen_ty_1),
            "::",
            stringify!(gmfn)
        )
    );
}
#[test]
fn bindgen_test_layout_gnttab_copy_gnttab_copy_ptr() {
    assert_eq!(
        ::std::mem::size_of::<gnttab_copy_gnttab_copy_ptr>(),
        16usize,
        concat!("Size of: ", stringify!(gnttab_copy_gnttab_copy_ptr))
    );
    assert_eq!(
        ::std::mem::align_of::<gnttab_copy_gnttab_copy_ptr>(),
        8usize,
        concat!("Alignment of ", stringify!(gnttab_copy_gnttab_copy_ptr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_copy_gnttab_copy_ptr>())).u as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_copy_gnttab_copy_ptr),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<gnttab_copy_gnttab_copy_ptr>())).domid as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_copy_gnttab_copy_ptr),
            "::",
            stringify!(domid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<gnttab_copy_gnttab_copy_ptr>())).offset as *const _ as usize
        },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_copy_gnttab_copy_ptr),
            "::",
            stringify!(offset)
        )
    );
}
#[test]
fn bindgen_test_layout_gnttab_copy() {
    assert_eq!(
        ::std::mem::size_of::<gnttab_copy>(),
        40usize,
        concat!("Size of: ", stringify!(gnttab_copy))
    );
    assert_eq!(
        ::std::mem::align_of::<gnttab_copy>(),
        8usize,
        concat!("Alignment of ", stringify!(gnttab_copy))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_copy>())).source as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_copy),
            "::",
            stringify!(source)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_copy>())).dest as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_copy),
            "::",
            stringify!(dest)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_copy>())).len as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_copy),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_copy>())).flags as *const _ as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_copy),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_copy>())).status as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_copy),
            "::",
            stringify!(status)
        )
    );
}
pub type gnttab_copy_t = gnttab_copy;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_copy_t {
    pub p: *mut gnttab_copy_t,
}
#[test]
fn bindgen_test_layout___guest_handle_gnttab_copy_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_gnttab_copy_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_gnttab_copy_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_gnttab_copy_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_gnttab_copy_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_gnttab_copy_t>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_gnttab_copy_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_copy_t {
    pub p: *const gnttab_copy_t,
}
#[test]
fn bindgen_test_layout___guest_handle_const_gnttab_copy_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_gnttab_copy_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_gnttab_copy_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_gnttab_copy_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_gnttab_copy_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_gnttab_copy_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_gnttab_copy_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gnttab_query_size {
    pub dom: domid_t,
    pub nr_frames: u32,
    pub max_nr_frames: u32,
    pub status: i16,
}
#[test]
fn bindgen_test_layout_gnttab_query_size() {
    assert_eq!(
        ::std::mem::size_of::<gnttab_query_size>(),
        16usize,
        concat!("Size of: ", stringify!(gnttab_query_size))
    );
    assert_eq!(
        ::std::mem::align_of::<gnttab_query_size>(),
        4usize,
        concat!("Alignment of ", stringify!(gnttab_query_size))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_query_size>())).dom as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_query_size),
            "::",
            stringify!(dom)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_query_size>())).nr_frames as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_query_size),
            "::",
            stringify!(nr_frames)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_query_size>())).max_nr_frames as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_query_size),
            "::",
            stringify!(max_nr_frames)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_query_size>())).status as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_query_size),
            "::",
            stringify!(status)
        )
    );
}
pub type gnttab_query_size_t = gnttab_query_size;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_query_size_t {
    pub p: *mut gnttab_query_size_t,
}
#[test]
fn bindgen_test_layout___guest_handle_gnttab_query_size_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_gnttab_query_size_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_gnttab_query_size_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_gnttab_query_size_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_gnttab_query_size_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_gnttab_query_size_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_gnttab_query_size_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_query_size_t {
    pub p: *const gnttab_query_size_t,
}
#[test]
fn bindgen_test_layout___guest_handle_const_gnttab_query_size_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_gnttab_query_size_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_const_gnttab_query_size_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_gnttab_query_size_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_gnttab_query_size_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_gnttab_query_size_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_gnttab_query_size_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gnttab_unmap_and_replace {
    pub host_addr: u64,
    pub new_addr: u64,
    pub handle: grant_handle_t,
    pub status: i16,
}
#[test]
fn bindgen_test_layout_gnttab_unmap_and_replace() {
    assert_eq!(
        ::std::mem::size_of::<gnttab_unmap_and_replace>(),
        24usize,
        concat!("Size of: ", stringify!(gnttab_unmap_and_replace))
    );
    assert_eq!(
        ::std::mem::align_of::<gnttab_unmap_and_replace>(),
        8usize,
        concat!("Alignment of ", stringify!(gnttab_unmap_and_replace))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<gnttab_unmap_and_replace>())).host_addr as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_unmap_and_replace),
            "::",
            stringify!(host_addr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<gnttab_unmap_and_replace>())).new_addr as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_unmap_and_replace),
            "::",
            stringify!(new_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_unmap_and_replace>())).handle as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_unmap_and_replace),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_unmap_and_replace>())).status as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_unmap_and_replace),
            "::",
            stringify!(status)
        )
    );
}
pub type gnttab_unmap_and_replace_t = gnttab_unmap_and_replace;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_unmap_and_replace_t {
    pub p: *mut gnttab_unmap_and_replace_t,
}
#[test]
fn bindgen_test_layout___guest_handle_gnttab_unmap_and_replace_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_gnttab_unmap_and_replace_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_gnttab_unmap_and_replace_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_gnttab_unmap_and_replace_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_gnttab_unmap_and_replace_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_gnttab_unmap_and_replace_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_gnttab_unmap_and_replace_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_unmap_and_replace_t {
    pub p: *const gnttab_unmap_and_replace_t,
}
#[test]
fn bindgen_test_layout___guest_handle_const_gnttab_unmap_and_replace_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_gnttab_unmap_and_replace_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_const_gnttab_unmap_and_replace_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_gnttab_unmap_and_replace_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_gnttab_unmap_and_replace_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_gnttab_unmap_and_replace_t>())).p
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_gnttab_unmap_and_replace_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gnttab_set_version {
    pub version: u32,
}
#[test]
fn bindgen_test_layout_gnttab_set_version() {
    assert_eq!(
        ::std::mem::size_of::<gnttab_set_version>(),
        4usize,
        concat!("Size of: ", stringify!(gnttab_set_version))
    );
    assert_eq!(
        ::std::mem::align_of::<gnttab_set_version>(),
        4usize,
        concat!("Alignment of ", stringify!(gnttab_set_version))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_set_version>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_set_version),
            "::",
            stringify!(version)
        )
    );
}
pub type gnttab_set_version_t = gnttab_set_version;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_set_version_t {
    pub p: *mut gnttab_set_version_t,
}
#[test]
fn bindgen_test_layout___guest_handle_gnttab_set_version_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_gnttab_set_version_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_gnttab_set_version_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_gnttab_set_version_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_gnttab_set_version_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_gnttab_set_version_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_gnttab_set_version_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_set_version_t {
    pub p: *const gnttab_set_version_t,
}
#[test]
fn bindgen_test_layout___guest_handle_const_gnttab_set_version_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_gnttab_set_version_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_const_gnttab_set_version_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_gnttab_set_version_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_gnttab_set_version_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_gnttab_set_version_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_gnttab_set_version_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gnttab_get_status_frames {
    pub nr_frames: u32,
    pub dom: domid_t,
    pub status: i16,
    pub frame_list: __guest_handle_uint64_t,
}
#[test]
fn bindgen_test_layout_gnttab_get_status_frames() {
    assert_eq!(
        ::std::mem::size_of::<gnttab_get_status_frames>(),
        16usize,
        concat!("Size of: ", stringify!(gnttab_get_status_frames))
    );
    assert_eq!(
        ::std::mem::align_of::<gnttab_get_status_frames>(),
        8usize,
        concat!("Alignment of ", stringify!(gnttab_get_status_frames))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<gnttab_get_status_frames>())).nr_frames as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_get_status_frames),
            "::",
            stringify!(nr_frames)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_get_status_frames>())).dom as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_get_status_frames),
            "::",
            stringify!(dom)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_get_status_frames>())).status as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_get_status_frames),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<gnttab_get_status_frames>())).frame_list as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_get_status_frames),
            "::",
            stringify!(frame_list)
        )
    );
}
pub type gnttab_get_status_frames_t = gnttab_get_status_frames;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_get_status_frames_t {
    pub p: *mut gnttab_get_status_frames_t,
}
#[test]
fn bindgen_test_layout___guest_handle_gnttab_get_status_frames_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_gnttab_get_status_frames_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_gnttab_get_status_frames_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_gnttab_get_status_frames_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_gnttab_get_status_frames_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_gnttab_get_status_frames_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_gnttab_get_status_frames_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_get_status_frames_t {
    pub p: *const gnttab_get_status_frames_t,
}
#[test]
fn bindgen_test_layout___guest_handle_const_gnttab_get_status_frames_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_gnttab_get_status_frames_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_const_gnttab_get_status_frames_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_gnttab_get_status_frames_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_gnttab_get_status_frames_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_gnttab_get_status_frames_t>())).p
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_gnttab_get_status_frames_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gnttab_get_version {
    pub dom: domid_t,
    pub pad: u16,
    pub version: u32,
}
#[test]
fn bindgen_test_layout_gnttab_get_version() {
    assert_eq!(
        ::std::mem::size_of::<gnttab_get_version>(),
        8usize,
        concat!("Size of: ", stringify!(gnttab_get_version))
    );
    assert_eq!(
        ::std::mem::align_of::<gnttab_get_version>(),
        4usize,
        concat!("Alignment of ", stringify!(gnttab_get_version))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_get_version>())).dom as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_get_version),
            "::",
            stringify!(dom)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_get_version>())).pad as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_get_version),
            "::",
            stringify!(pad)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_get_version>())).version as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_get_version),
            "::",
            stringify!(version)
        )
    );
}
pub type gnttab_get_version_t = gnttab_get_version;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_get_version_t {
    pub p: *mut gnttab_get_version_t,
}
#[test]
fn bindgen_test_layout___guest_handle_gnttab_get_version_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_gnttab_get_version_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_gnttab_get_version_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_gnttab_get_version_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_gnttab_get_version_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_gnttab_get_version_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_gnttab_get_version_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_get_version_t {
    pub p: *const gnttab_get_version_t,
}
#[test]
fn bindgen_test_layout___guest_handle_const_gnttab_get_version_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_gnttab_get_version_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_const_gnttab_get_version_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_gnttab_get_version_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_gnttab_get_version_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_gnttab_get_version_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_gnttab_get_version_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gnttab_swap_grant_ref {
    pub ref_a: grant_ref_t,
    pub ref_b: grant_ref_t,
    pub status: i16,
}
#[test]
fn bindgen_test_layout_gnttab_swap_grant_ref() {
    assert_eq!(
        ::std::mem::size_of::<gnttab_swap_grant_ref>(),
        12usize,
        concat!("Size of: ", stringify!(gnttab_swap_grant_ref))
    );
    assert_eq!(
        ::std::mem::align_of::<gnttab_swap_grant_ref>(),
        4usize,
        concat!("Alignment of ", stringify!(gnttab_swap_grant_ref))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_swap_grant_ref>())).ref_a as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_swap_grant_ref),
            "::",
            stringify!(ref_a)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_swap_grant_ref>())).ref_b as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_swap_grant_ref),
            "::",
            stringify!(ref_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_swap_grant_ref>())).status as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_swap_grant_ref),
            "::",
            stringify!(status)
        )
    );
}
pub type gnttab_swap_grant_ref_t = gnttab_swap_grant_ref;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_swap_grant_ref_t {
    pub p: *mut gnttab_swap_grant_ref_t,
}
#[test]
fn bindgen_test_layout___guest_handle_gnttab_swap_grant_ref_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_gnttab_swap_grant_ref_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_gnttab_swap_grant_ref_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_gnttab_swap_grant_ref_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_gnttab_swap_grant_ref_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_gnttab_swap_grant_ref_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_gnttab_swap_grant_ref_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_swap_grant_ref_t {
    pub p: *const gnttab_swap_grant_ref_t,
}
#[test]
fn bindgen_test_layout___guest_handle_const_gnttab_swap_grant_ref_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_gnttab_swap_grant_ref_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_const_gnttab_swap_grant_ref_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_gnttab_swap_grant_ref_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_gnttab_swap_grant_ref_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_gnttab_swap_grant_ref_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_gnttab_swap_grant_ref_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct gnttab_cache_flush {
    pub a: gnttab_cache_flush__bindgen_ty_1,
    pub offset: u16,
    pub length: u16,
    pub op: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union gnttab_cache_flush__bindgen_ty_1 {
    pub dev_bus_addr: u64,
    pub ref_: grant_ref_t,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_gnttab_cache_flush__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<gnttab_cache_flush__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(gnttab_cache_flush__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<gnttab_cache_flush__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(gnttab_cache_flush__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<gnttab_cache_flush__bindgen_ty_1>())).dev_bus_addr as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_cache_flush__bindgen_ty_1),
            "::",
            stringify!(dev_bus_addr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<gnttab_cache_flush__bindgen_ty_1>())).ref_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_cache_flush__bindgen_ty_1),
            "::",
            stringify!(ref_)
        )
    );
}
#[test]
fn bindgen_test_layout_gnttab_cache_flush() {
    assert_eq!(
        ::std::mem::size_of::<gnttab_cache_flush>(),
        16usize,
        concat!("Size of: ", stringify!(gnttab_cache_flush))
    );
    assert_eq!(
        ::std::mem::align_of::<gnttab_cache_flush>(),
        8usize,
        concat!("Alignment of ", stringify!(gnttab_cache_flush))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_cache_flush>())).a as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_cache_flush),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_cache_flush>())).offset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_cache_flush),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_cache_flush>())).length as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_cache_flush),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_cache_flush>())).op as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_cache_flush),
            "::",
            stringify!(op)
        )
    );
}
pub type gnttab_cache_flush_t = gnttab_cache_flush;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_cache_flush_t {
    pub p: *mut gnttab_cache_flush_t,
}
#[test]
fn bindgen_test_layout___guest_handle_gnttab_cache_flush_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_gnttab_cache_flush_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_gnttab_cache_flush_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_gnttab_cache_flush_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_gnttab_cache_flush_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_gnttab_cache_flush_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_gnttab_cache_flush_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_cache_flush_t {
    pub p: *const gnttab_cache_flush_t,
}
#[test]
fn bindgen_test_layout___guest_handle_const_gnttab_cache_flush_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_gnttab_cache_flush_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_const_gnttab_cache_flush_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_gnttab_cache_flush_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_gnttab_cache_flush_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_gnttab_cache_flush_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_gnttab_cache_flush_t),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hvm_save_descriptor {
    pub typecode: u16,
    pub instance: u16,
    pub length: u32,
}
#[test]
fn bindgen_test_layout_hvm_save_descriptor() {
    assert_eq!(
        ::std::mem::size_of::<hvm_save_descriptor>(),
        8usize,
        concat!("Size of: ", stringify!(hvm_save_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<hvm_save_descriptor>(),
        4usize,
        concat!("Alignment of ", stringify!(hvm_save_descriptor))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_save_descriptor>())).typecode as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_save_descriptor),
            "::",
            stringify!(typecode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_save_descriptor>())).instance as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_save_descriptor),
            "::",
            stringify!(instance)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_save_descriptor>())).length as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_save_descriptor),
            "::",
            stringify!(length)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hvm_save_end {}
#[test]
fn bindgen_test_layout_hvm_save_end() {
    assert_eq!(
        ::std::mem::size_of::<hvm_save_end>(),
        0usize,
        concat!("Size of: ", stringify!(hvm_save_end))
    );
    assert_eq!(
        ::std::mem::align_of::<hvm_save_end>(),
        1usize,
        concat!("Alignment of ", stringify!(hvm_save_end))
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct __HVM_SAVE_TYPE_END {
    pub t: hvm_save_end,
    pub c: __IncompleteArrayField<::std::os::raw::c_char>,
    pub cpt: [::std::os::raw::c_char; 1usize],
}
#[test]
fn bindgen_test_layout___HVM_SAVE_TYPE_END() {
    assert_eq!(
        ::std::mem::size_of::<__HVM_SAVE_TYPE_END>(),
        1usize,
        concat!("Size of: ", stringify!(__HVM_SAVE_TYPE_END))
    );
    assert_eq!(
        ::std::mem::align_of::<__HVM_SAVE_TYPE_END>(),
        1usize,
        concat!("Alignment of ", stringify!(__HVM_SAVE_TYPE_END))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__HVM_SAVE_TYPE_END>())).t as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__HVM_SAVE_TYPE_END),
            "::",
            stringify!(t)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__HVM_SAVE_TYPE_END>())).c as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__HVM_SAVE_TYPE_END),
            "::",
            stringify!(c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__HVM_SAVE_TYPE_END>())).cpt as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__HVM_SAVE_TYPE_END),
            "::",
            stringify!(cpt)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hvm_save_header {
    pub magic: u32,
    pub version: u32,
    pub changeset: u64,
    pub cpuid: u32,
    pub gtsc_khz: u32,
}
#[test]
fn bindgen_test_layout_hvm_save_header() {
    assert_eq!(
        ::std::mem::size_of::<hvm_save_header>(),
        24usize,
        concat!("Size of: ", stringify!(hvm_save_header))
    );
    assert_eq!(
        ::std::mem::align_of::<hvm_save_header>(),
        8usize,
        concat!("Alignment of ", stringify!(hvm_save_header))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_save_header>())).magic as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_save_header),
            "::",
            stringify!(magic)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_save_header>())).version as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_save_header),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_save_header>())).changeset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_save_header),
            "::",
            stringify!(changeset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_save_header>())).cpuid as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_save_header),
            "::",
            stringify!(cpuid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_save_header>())).gtsc_khz as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_save_header),
            "::",
            stringify!(gtsc_khz)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __HVM_SAVE_TYPE_HEADER {
    pub t: hvm_save_header,
    pub c: [::std::os::raw::c_char; 1usize],
    pub cpt: [::std::os::raw::c_char; 1usize],
}
#[test]
fn bindgen_test_layout___HVM_SAVE_TYPE_HEADER() {
    assert_eq!(
        ::std::mem::size_of::<__HVM_SAVE_TYPE_HEADER>(),
        32usize,
        concat!("Size of: ", stringify!(__HVM_SAVE_TYPE_HEADER))
    );
    assert_eq!(
        ::std::mem::align_of::<__HVM_SAVE_TYPE_HEADER>(),
        8usize,
        concat!("Alignment of ", stringify!(__HVM_SAVE_TYPE_HEADER))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__HVM_SAVE_TYPE_HEADER>())).t as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__HVM_SAVE_TYPE_HEADER),
            "::",
            stringify!(t)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__HVM_SAVE_TYPE_HEADER>())).c as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__HVM_SAVE_TYPE_HEADER),
            "::",
            stringify!(c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__HVM_SAVE_TYPE_HEADER>())).cpt as *const _ as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(__HVM_SAVE_TYPE_HEADER),
            "::",
            stringify!(cpt)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct hvm_hw_cpu {
    pub fpu_regs: [u8; 512usize],
    pub rax: u64,
    pub rbx: u64,
    pub rcx: u64,
    pub rdx: u64,
    pub rbp: u64,
    pub rsi: u64,
    pub rdi: u64,
    pub rsp: u64,
    pub r8: u64,
    pub r9: u64,
    pub r10: u64,
    pub r11: u64,
    pub r12: u64,
    pub r13: u64,
    pub r14: u64,
    pub r15: u64,
    pub rip: u64,
    pub rflags: u64,
    pub cr0: u64,
    pub cr2: u64,
    pub cr3: u64,
    pub cr4: u64,
    pub dr0: u64,
    pub dr1: u64,
    pub dr2: u64,
    pub dr3: u64,
    pub dr6: u64,
    pub dr7: u64,
    pub cs_sel: u32,
    pub ds_sel: u32,
    pub es_sel: u32,
    pub fs_sel: u32,
    pub gs_sel: u32,
    pub ss_sel: u32,
    pub tr_sel: u32,
    pub ldtr_sel: u32,
    pub cs_limit: u32,
    pub ds_limit: u32,
    pub es_limit: u32,
    pub fs_limit: u32,
    pub gs_limit: u32,
    pub ss_limit: u32,
    pub tr_limit: u32,
    pub ldtr_limit: u32,
    pub idtr_limit: u32,
    pub gdtr_limit: u32,
    pub cs_base: u64,
    pub ds_base: u64,
    pub es_base: u64,
    pub fs_base: u64,
    pub gs_base: u64,
    pub ss_base: u64,
    pub tr_base: u64,
    pub ldtr_base: u64,
    pub idtr_base: u64,
    pub gdtr_base: u64,
    pub cs_arbytes: u32,
    pub ds_arbytes: u32,
    pub es_arbytes: u32,
    pub fs_arbytes: u32,
    pub gs_arbytes: u32,
    pub ss_arbytes: u32,
    pub tr_arbytes: u32,
    pub ldtr_arbytes: u32,
    pub sysenter_cs: u64,
    pub sysenter_esp: u64,
    pub sysenter_eip: u64,
    pub shadow_gs: u64,
    pub msr_flags: u64,
    pub msr_lstar: u64,
    pub msr_star: u64,
    pub msr_cstar: u64,
    pub msr_syscall_mask: u64,
    pub msr_efer: u64,
    pub msr_tsc_aux: u64,
    pub tsc: u64,
    pub __bindgen_anon_1: hvm_hw_cpu__bindgen_ty_1,
    pub error_code: u32,
    pub flags: u32,
    pub pad0: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union hvm_hw_cpu__bindgen_ty_1 {
    pub pending_event: u32,
    pub __bindgen_anon_1: hvm_hw_cpu__bindgen_ty_1__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct hvm_hw_cpu__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
}
#[test]
fn bindgen_test_layout_hvm_hw_cpu__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<hvm_hw_cpu__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(hvm_hw_cpu__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<hvm_hw_cpu__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(hvm_hw_cpu__bindgen_ty_1__bindgen_ty_1)
        )
    );
}
impl hvm_hw_cpu__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn pending_vector(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u8) }
    }
    #[inline]
    pub fn set_pending_vector(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn pending_type(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_pending_type(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn pending_error_valid(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_pending_error_valid(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn pending_reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 19u8) as u32) }
    }
    #[inline]
    pub fn set_pending_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 19u8, val as u64)
        }
    }
    #[inline]
    pub fn pending_valid(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_pending_valid(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        pending_vector: u8,
        pending_type: u8,
        pending_error_valid: u8,
        pending_reserved: u32,
        pending_valid: u8,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let pending_vector: u8 = unsafe { ::std::mem::transmute(pending_vector) };
            pending_vector as u64
        });
        __bindgen_bitfield_unit.set(8usize, 3u8, {
            let pending_type: u8 = unsafe { ::std::mem::transmute(pending_type) };
            pending_type as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let pending_error_valid: u8 = unsafe { ::std::mem::transmute(pending_error_valid) };
            pending_error_valid as u64
        });
        __bindgen_bitfield_unit.set(12usize, 19u8, {
            let pending_reserved: u32 = unsafe { ::std::mem::transmute(pending_reserved) };
            pending_reserved as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let pending_valid: u8 = unsafe { ::std::mem::transmute(pending_valid) };
            pending_valid as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_hvm_hw_cpu__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<hvm_hw_cpu__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(hvm_hw_cpu__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<hvm_hw_cpu__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(hvm_hw_cpu__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<hvm_hw_cpu__bindgen_ty_1>())).pending_event as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu__bindgen_ty_1),
            "::",
            stringify!(pending_event)
        )
    );
}
#[test]
fn bindgen_test_layout_hvm_hw_cpu() {
    assert_eq!(
        ::std::mem::size_of::<hvm_hw_cpu>(),
        1032usize,
        concat!("Size of: ", stringify!(hvm_hw_cpu))
    );
    assert_eq!(
        ::std::mem::align_of::<hvm_hw_cpu>(),
        8usize,
        concat!("Alignment of ", stringify!(hvm_hw_cpu))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).fpu_regs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(fpu_regs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).rax as *const _ as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(rax)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).rbx as *const _ as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(rbx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).rcx as *const _ as usize },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(rcx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).rdx as *const _ as usize },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(rdx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).rbp as *const _ as usize },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(rbp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).rsi as *const _ as usize },
        552usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(rsi)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).rdi as *const _ as usize },
        560usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(rdi)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).rsp as *const _ as usize },
        568usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(rsp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).r8 as *const _ as usize },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(r8)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).r9 as *const _ as usize },
        584usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(r9)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).r10 as *const _ as usize },
        592usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(r10)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).r11 as *const _ as usize },
        600usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(r11)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).r12 as *const _ as usize },
        608usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(r12)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).r13 as *const _ as usize },
        616usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(r13)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).r14 as *const _ as usize },
        624usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(r14)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).r15 as *const _ as usize },
        632usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(r15)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).rip as *const _ as usize },
        640usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(rip)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).rflags as *const _ as usize },
        648usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(rflags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).cr0 as *const _ as usize },
        656usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(cr0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).cr2 as *const _ as usize },
        664usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(cr2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).cr3 as *const _ as usize },
        672usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(cr3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).cr4 as *const _ as usize },
        680usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(cr4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).dr0 as *const _ as usize },
        688usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(dr0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).dr1 as *const _ as usize },
        696usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(dr1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).dr2 as *const _ as usize },
        704usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(dr2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).dr3 as *const _ as usize },
        712usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(dr3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).dr6 as *const _ as usize },
        720usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(dr6)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).dr7 as *const _ as usize },
        728usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(dr7)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).cs_sel as *const _ as usize },
        736usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(cs_sel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).ds_sel as *const _ as usize },
        740usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(ds_sel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).es_sel as *const _ as usize },
        744usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(es_sel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).fs_sel as *const _ as usize },
        748usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(fs_sel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).gs_sel as *const _ as usize },
        752usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(gs_sel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).ss_sel as *const _ as usize },
        756usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(ss_sel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).tr_sel as *const _ as usize },
        760usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(tr_sel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).ldtr_sel as *const _ as usize },
        764usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(ldtr_sel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).cs_limit as *const _ as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(cs_limit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).ds_limit as *const _ as usize },
        772usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(ds_limit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).es_limit as *const _ as usize },
        776usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(es_limit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).fs_limit as *const _ as usize },
        780usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(fs_limit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).gs_limit as *const _ as usize },
        784usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(gs_limit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).ss_limit as *const _ as usize },
        788usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(ss_limit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).tr_limit as *const _ as usize },
        792usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(tr_limit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).ldtr_limit as *const _ as usize },
        796usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(ldtr_limit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).idtr_limit as *const _ as usize },
        800usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(idtr_limit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).gdtr_limit as *const _ as usize },
        804usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(gdtr_limit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).cs_base as *const _ as usize },
        808usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(cs_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).ds_base as *const _ as usize },
        816usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(ds_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).es_base as *const _ as usize },
        824usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(es_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).fs_base as *const _ as usize },
        832usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(fs_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).gs_base as *const _ as usize },
        840usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(gs_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).ss_base as *const _ as usize },
        848usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(ss_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).tr_base as *const _ as usize },
        856usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(tr_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).ldtr_base as *const _ as usize },
        864usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(ldtr_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).idtr_base as *const _ as usize },
        872usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(idtr_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).gdtr_base as *const _ as usize },
        880usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(gdtr_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).cs_arbytes as *const _ as usize },
        888usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(cs_arbytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).ds_arbytes as *const _ as usize },
        892usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(ds_arbytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).es_arbytes as *const _ as usize },
        896usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(es_arbytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).fs_arbytes as *const _ as usize },
        900usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(fs_arbytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).gs_arbytes as *const _ as usize },
        904usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(gs_arbytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).ss_arbytes as *const _ as usize },
        908usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(ss_arbytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).tr_arbytes as *const _ as usize },
        912usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(tr_arbytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).ldtr_arbytes as *const _ as usize },
        916usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(ldtr_arbytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).sysenter_cs as *const _ as usize },
        920usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(sysenter_cs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).sysenter_esp as *const _ as usize },
        928usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(sysenter_esp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).sysenter_eip as *const _ as usize },
        936usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(sysenter_eip)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).shadow_gs as *const _ as usize },
        944usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(shadow_gs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).msr_flags as *const _ as usize },
        952usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(msr_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).msr_lstar as *const _ as usize },
        960usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(msr_lstar)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).msr_star as *const _ as usize },
        968usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(msr_star)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).msr_cstar as *const _ as usize },
        976usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(msr_cstar)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).msr_syscall_mask as *const _ as usize },
        984usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(msr_syscall_mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).msr_efer as *const _ as usize },
        992usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(msr_efer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).msr_tsc_aux as *const _ as usize },
        1000usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(msr_tsc_aux)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).tsc as *const _ as usize },
        1008usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(tsc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).error_code as *const _ as usize },
        1020usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(error_code)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).flags as *const _ as usize },
        1024usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu>())).pad0 as *const _ as usize },
        1028usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu),
            "::",
            stringify!(pad0)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct hvm_hw_cpu_compat {
    pub fpu_regs: [u8; 512usize],
    pub rax: u64,
    pub rbx: u64,
    pub rcx: u64,
    pub rdx: u64,
    pub rbp: u64,
    pub rsi: u64,
    pub rdi: u64,
    pub rsp: u64,
    pub r8: u64,
    pub r9: u64,
    pub r10: u64,
    pub r11: u64,
    pub r12: u64,
    pub r13: u64,
    pub r14: u64,
    pub r15: u64,
    pub rip: u64,
    pub rflags: u64,
    pub cr0: u64,
    pub cr2: u64,
    pub cr3: u64,
    pub cr4: u64,
    pub dr0: u64,
    pub dr1: u64,
    pub dr2: u64,
    pub dr3: u64,
    pub dr6: u64,
    pub dr7: u64,
    pub cs_sel: u32,
    pub ds_sel: u32,
    pub es_sel: u32,
    pub fs_sel: u32,
    pub gs_sel: u32,
    pub ss_sel: u32,
    pub tr_sel: u32,
    pub ldtr_sel: u32,
    pub cs_limit: u32,
    pub ds_limit: u32,
    pub es_limit: u32,
    pub fs_limit: u32,
    pub gs_limit: u32,
    pub ss_limit: u32,
    pub tr_limit: u32,
    pub ldtr_limit: u32,
    pub idtr_limit: u32,
    pub gdtr_limit: u32,
    pub cs_base: u64,
    pub ds_base: u64,
    pub es_base: u64,
    pub fs_base: u64,
    pub gs_base: u64,
    pub ss_base: u64,
    pub tr_base: u64,
    pub ldtr_base: u64,
    pub idtr_base: u64,
    pub gdtr_base: u64,
    pub cs_arbytes: u32,
    pub ds_arbytes: u32,
    pub es_arbytes: u32,
    pub fs_arbytes: u32,
    pub gs_arbytes: u32,
    pub ss_arbytes: u32,
    pub tr_arbytes: u32,
    pub ldtr_arbytes: u32,
    pub sysenter_cs: u64,
    pub sysenter_esp: u64,
    pub sysenter_eip: u64,
    pub shadow_gs: u64,
    pub msr_flags: u64,
    pub msr_lstar: u64,
    pub msr_star: u64,
    pub msr_cstar: u64,
    pub msr_syscall_mask: u64,
    pub msr_efer: u64,
    pub tsc: u64,
    pub __bindgen_anon_1: hvm_hw_cpu_compat__bindgen_ty_1,
    pub error_code: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union hvm_hw_cpu_compat__bindgen_ty_1 {
    pub pending_event: u32,
    pub __bindgen_anon_1: hvm_hw_cpu_compat__bindgen_ty_1__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct hvm_hw_cpu_compat__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
}
#[test]
fn bindgen_test_layout_hvm_hw_cpu_compat__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<hvm_hw_cpu_compat__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(hvm_hw_cpu_compat__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<hvm_hw_cpu_compat__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(hvm_hw_cpu_compat__bindgen_ty_1__bindgen_ty_1)
        )
    );
}
impl hvm_hw_cpu_compat__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn pending_vector(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u8) }
    }
    #[inline]
    pub fn set_pending_vector(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn pending_type(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_pending_type(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn pending_error_valid(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_pending_error_valid(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn pending_reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 19u8) as u32) }
    }
    #[inline]
    pub fn set_pending_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 19u8, val as u64)
        }
    }
    #[inline]
    pub fn pending_valid(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_pending_valid(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        pending_vector: u8,
        pending_type: u8,
        pending_error_valid: u8,
        pending_reserved: u32,
        pending_valid: u8,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let pending_vector: u8 = unsafe { ::std::mem::transmute(pending_vector) };
            pending_vector as u64
        });
        __bindgen_bitfield_unit.set(8usize, 3u8, {
            let pending_type: u8 = unsafe { ::std::mem::transmute(pending_type) };
            pending_type as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let pending_error_valid: u8 = unsafe { ::std::mem::transmute(pending_error_valid) };
            pending_error_valid as u64
        });
        __bindgen_bitfield_unit.set(12usize, 19u8, {
            let pending_reserved: u32 = unsafe { ::std::mem::transmute(pending_reserved) };
            pending_reserved as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let pending_valid: u8 = unsafe { ::std::mem::transmute(pending_valid) };
            pending_valid as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_hvm_hw_cpu_compat__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<hvm_hw_cpu_compat__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(hvm_hw_cpu_compat__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<hvm_hw_cpu_compat__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(hvm_hw_cpu_compat__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<hvm_hw_cpu_compat__bindgen_ty_1>())).pending_event as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu_compat__bindgen_ty_1),
            "::",
            stringify!(pending_event)
        )
    );
}
#[test]
fn bindgen_test_layout_hvm_hw_cpu_compat() {
    assert_eq!(
        ::std::mem::size_of::<hvm_hw_cpu_compat>(),
        1016usize,
        concat!("Size of: ", stringify!(hvm_hw_cpu_compat))
    );
    assert_eq!(
        ::std::mem::align_of::<hvm_hw_cpu_compat>(),
        8usize,
        concat!("Alignment of ", stringify!(hvm_hw_cpu_compat))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu_compat>())).fpu_regs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu_compat),
            "::",
            stringify!(fpu_regs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu_compat>())).rax as *const _ as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu_compat),
            "::",
            stringify!(rax)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu_compat>())).rbx as *const _ as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu_compat),
            "::",
            stringify!(rbx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu_compat>())).rcx as *const _ as usize },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu_compat),
            "::",
            stringify!(rcx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu_compat>())).rdx as *const _ as usize },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu_compat),
            "::",
            stringify!(rdx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu_compat>())).rbp as *const _ as usize },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(hvm_hw_cpu_compat),
            "::",
            stringify!(rbp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hvm_hw_cpu_compat>())).rsi as *const _ as usize },
        552usize,
